{
  "name" : "RUSH HOUR",
  "authors" : [ "Ross LaManna", "Jim Kouf" ],
  "characters" : [ "MAN'S VOICE", "WHITNEY", "EVANS", "GRIFFIN (cont'd)", "LAFONTAINE", "DRIVER", "CARTER (cont'd)", "BODYGUARD", "LOIS VO", "SANG", "FIRST DETECTIVE", "CARTER'S VOICE", "NEWS ANNOUNCER", "JOHNSON (cont'd)", "BIG DUDE", "OSCAR", "SOON YOUNG'S VOICE", "HESS", "CARTER", "FBI AGENT WILLIS", "RUSS", "PATIO AGENT", "EVANS VOICE", "DIEL", "LEE AND CARTER", "GRIFFIN", "LOIS", "AGENT", "LOIS (cont'd)", "LEE (cont'd)", "SOCIALITE", "MONROE", "THE DETECTIVE", "SOON YOUNG", "AGENT WHITNEY", "LEAD AGENT TACTICAL TEAM", "WHITNEY (cont'd)", "OFFICER", "POLICE OFFICER", "LEE", "ATTRACTIVE WAITRESS", "JOHNSON", "SANG'S VOICE", "CARTER VO", "LEE VO", "RUSS (cont'd)", "HAN", "FBI AGENT GEIGER", "HOSTESS", "LEE'S VOICE", "SECOND DETECTIVE", "SECOND POLICE OFFICER", "LAFONTAINE (cont'd)", "FLIGHT ATTENDANT" ],
  "scenes" : [ {
    "id" : 1,
    "transition" : "FADE IN:",
    "position" : "EXT.",
    "place" : "HONG KONG",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We're in a HELICOPTER POV flying over Hong Kong's dazzling skyline. SUPER - HONG KONG - JUNE 30, 1997 FADE UP the sound of a RADIO NEWSCAST as we continue to fly over luxury, high rise condos, gleaming corporate headquarters, and busy freeways.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "NEWS ANNOUNCER",
        "line" : "(British accent) ...and now, in something less than three hours, what was once known as the Asian pearl of the British Empire will revert forever to The People's Republic of China...",
        "followup" : "Suddenly, we break out of the lights of the city and FLY LOW over the dark harbor. The newscaster's voice blends with the WHUMP WHUMP of the chopper. "
      } ],
      "key_words" : [ "JUNE", "SUPER", "FADE UP", "WHUMP WHUMP", "NEWS ANNOUNCER", "HELICOPTER POV", "RADIO NEWSCAST", "HONG KONG", "FLY LOW" ]
    } ]
  }, {
    "id" : 2,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "A WAREHOUSE-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We're CLOSE on a huge gleaming DRAGON made of tin. The dragon seems to float effortlessly across a concrete warehouse floor. PULL BACK until we see that it's riding on a fork lift toward a SHIP docked at the warehouse. As the dragon moves, we see it pass PRICELESS CHINESE ART OBJECTS including ceramics, glass paintings, and huge statues. CHINESE MEN move quickly as they load this precious cargo into the hold of the ship. ",
      "sentences" : [ ],
      "key_words" : [ "PULL BACK", "PRICELESS CHINESE ART OBJECTS", "DRAGON", "SHIP", "CLOSE", "CHINESE MEN" ]
    } ]
  }, {
    "id" : 3,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE HOLD-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The dragon is now descending right on top of us as it's lowered by A CRANE. A Chinese man carrying an AUTOMATIC WEAPON looks up at the dragon as he walks by. We hold on the dragon. Suddenly, A MAN'S FACE appears in the dragon's mouth. This is LEE, dressed all in black. He dives head first out of the dragon and lands silently on the deck. ",
      "sentences" : [ ],
      "key_words" : [ "MAN'S FACE", "AUTOMATIC WEAPON", "LEE", "CRANE" ]
    } ]
  }, {
    "id" : 4,
    "transition" : "",
    "position" : "",
    "place" : "EXT.THE SHIP-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Another GUARD, cradling an M-16, walks around a railing and looks over the side. Suddenly, A HAND reaches up and pulls him over the edge. He disappears and a beat later we HEAR A SPLASH.",
      "sentences" : [ ],
      "key_words" : [ "GUARD", "SPLASH", "HAND", "HEAR" ]
    }, {
      "id" : 1,
      "on" : "ON ANOTHER GUARD",
      "desc" : "He's coming up a LADDER, automatic weapon slung over his shoulder. He HEARS something, turns on the ladder. Nothing. When he starts back up WHACK! A foot kicks him off the ladder and the ship. SPLASH.",
      "sentences" : [ ],
      "key_words" : [ "HEARS", "WHACK", "LADDER", "SPLASH" ]
    }, {
      "id" : 2,
      "on" : "ON TWO GUARDS",
      "desc" : "Lee dispatches them with a FLURRY OF HANDS. SPLASH, SPLASH.",
      "sentences" : [ ],
      "key_words" : [ "FLURRY OF HANDS", "SPLASH" ]
    }, {
      "id" : 3,
      "on" : "ON THE BOSS",
      "desc" : "A handsome Chinese man named SANG stands at the railing watching the loading process. He SHOUTS in MANDARIN and people jump to his command. Then something catches his eye. CLOSE ON The top of the warehouse. We see another man's FACE peer over the edge. And then disappear again.",
      "sentences" : [ ],
      "key_words" : [ "SANG", "SHOUTS", "MANDARIN", "FACE", "CLOSE ON" ]
    }, {
      "id" : 4,
      "on" : "ON THE WAREHOUSE",
      "desc" : "Ten HONG KONG COPS, weapons at the ready, are spread out on the roof watching the loading action.",
      "sentences" : [ ],
      "key_words" : [ "HONG KONG COPS" ]
    }, {
      "id" : 5,
      "on" : "ON SANG",
      "desc" : "He turns and sees A HELICOPTER in the distance bearing down on the boat. Without showing any panic, Sang steps inside his ship office. He runs to his desk and grabs a REBREATHER MASK from a drawer. He looks up suddenly and sees Lee standing in the doorway. Sang doesn't move a muscle as the two men stare at each other. Suddenly AUTOMATIC GUNFIRE erupts everywhere as the raid beings. Sang dives for a Berretta taped under his desk. He grabs it and starts firing. Lee rolls across the office dodging bullets. Sang runs out and down a flight of steps. Lee follows on his heels. ",
      "sentences" : [ ],
      "key_words" : [ "AUTOMATIC GUNFIRE", "HELICOPTER", "REBREATHER MASK" ]
    } ]
  }, {
    "id" : 5,
    "transition" : "",
    "position" : "EXT.",
    "place" : "THE SHIP-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A battle is in full progress as the Cops fire down on the bad guys. The helicopter joins the fray. We see a machine gun spray the warehouse from the chopper's open door. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 6,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE BOAT-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Sang runs down another flight of steps, deeper in the bowels of the ship. He stops for an instant and fits the REBREATHER MASK over his face. Then he turns and fires four rounds at Lee who has to dive back in another passageway.",
      "sentences" : [ ],
      "key_words" : [ "REBREATHER MASK" ]
    }, {
      "id" : 1,
      "on" : "ON LEE",
      "desc" : "He comes hurtling down the steps. He stops. We hear nothing except the distant sound of GUNFIRE. Then faintly at first, we hear WATER SLOSHING. Lee walks down a dark passageway and stops. He looks down at a round HOLE in the deck, just big enough for a man. Dark harbor water SLOSHES in the hole. ",
      "sentences" : [ ],
      "key_words" : [ "HOLE", "GUNFIRE", "SLOSHING", "SLOSHES", "WATER" ]
    } ]
  }, {
    "id" : 7,
    "transition" : "",
    "position" : "EXT.",
    "place" : "DECK-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee runs up on deck as the battle is ending. Police arrest dozens of bad guys. But Lee looks out at the water where one bad guy got away. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 8,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "HAN'S RESIDENCE",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We're in a LARGE ORIENTAL GARDEN for a black tie dinner. Tuxedos and gowns. An assortment of worldly players. HAN, a handsome charismatic man is the focus of attention. He and his wife CHI-YING are at one of the tables. THOMAS GRIFFIN, 50, British, but warm and personable, has the floor. He is at Han's table, holding up a glass of bubbly.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "-- because in my heart, I look upon it as a tragedy. Yes, ladies and gentlemen, a tragedy. (to Han) Forgive me, my friend. But I believe Hong Kong cannot afford to lose men of your character. It's understandable that China has envisioned a new role for you in the United States. But those of us here in law enforcement, can only look upon your leave-taking with sadness. And speaking personally, I will sorely miss your unbridled support of British Hong Kong Police. So, for all us Brits who ever carried a shield in Hong Kong... (lifts his glass) We will miss you, but we wish you nothing but happiness in America.",
        "followup" : "The glasses clink. Lee, now dressed in a tuxedo, suddenly appears at Han's side. He whispers something in his ear. Han stands, glass in hand."
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "(to Griffin) Tom, thank you. Very much. (to the group) I am pleased to be able to leave you and Hong Kong with a gift tonight: less than an hour ago, Detective Lee and his special task force have once and for all crushed the Juntao Criminal Organization. Shock and then applause all around the table. This is the kind of legacy I have dreamed about: to leave this city safer than I found it. To Hong Kong...forever.",
        "followup" : "Everyone drinks."
      } ],
      "key_words" : [ "YING", "THOMAS GRIFFIN", "HAN", "CHI", "LARGE ORIENTAL GARDEN", "GRIFFIN" ]
    }, {
      "id" : 1,
      "on" : "ON LEE",
      "desc" : "He's walking back up to the house when he senses someone behind him. He turns and receives a fist to the stomach. SOON YOUNG, Han's daughter is pissed.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "SOON YOUNG",
        "line" : "When were you going to tell me you were not going with us?",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LEE",
        "line" : "I still have work to do here.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "SOON YOUNG",
        "line" : "I don't believe you. My father was explaining to Mr. Griffin. That is how I found out.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LEE",
        "line" : "I was trying to find the right time.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "SOON YOUNG",
        "line" : "After I left?",
        "followup" : "And she throws another punch at him. But he catches her hand. And holds it tightly, to keep from being hit again."
      }, {
        "shot_id" : 1,
        "character" : "LEE",
        "line" : "I am going to miss you very much, Soon Young. If I ever have a daughter, I hope she is like you. Soon Young yanks her hand away from him. She glares at him for a moment, then --",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "SOON YOUNG",
        "line" : "I will not have friends in America.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LEE",
        "line" : "Soon Young, don't worry. You will have many friends very soon. You will see. America is a very friendly place. ",
        "followup" : ""
      } ],
      "key_words" : [ "SOON YOUNG", "LEE" ]
    } ]
  }, {
    "id" : 9,
    "transition" : "DISSOLVE TO:",
    "position" : "EXT.",
    "place" : "A DINER-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We're somewhere in DOWNEY, CALIFORNIA looking at a VINTAGE DINER with a lot of glass windows all the way around it. We see two women seated in a booth, looking out at us. ",
      "sentences" : [ ],
      "key_words" : [ "CALIFORNIA", "DOWNEY", "VINTAGE DINER" ]
    } ]
  }, {
    "id" : 10,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE DINER-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "One woman is SHIRLEY JOHNSON, beautiful, poised, generally not nervous like she is now. The other woman, LOIS, is in her early 20's, nasty looking, dangerous, and strung out. Both women are looking out into the parking lot. After a beat, Johnson gets up.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "I gotta pee.",
        "followup" : "She walks away. Lois watches her closely. "
      } ],
      "key_words" : [ "JOHNSON", "SHIRLEY JOHNSON", "LOIS" ]
    } ]
  }, {
    "id" : 11,
    "transition" : "",
    "position" : "EXT.",
    "place" : "THE DINER PARKING LOT-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We're on JAMES CARTER mid twenties, dressed to impress. It doesn't appear to be working, however, because he has a GUN to his head.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "You don't move, you understand?! You don't move!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Do I look like I'm movin'?! What you're seeing here? This is not movement. This is my \"still\".",
        "followup" : "The man who is holding the gun is HENRY LAFONTAINE, thirty, shaved head, expensive clothes. Lafontaine pushes Carter until he's leaning forward on a parked JAGUAR. He starts patting Carter down. With his feet spread apart, hands spread on the trunk, Carter looks like a suspect who is being arrested. Lafontaine starts feeling around Carter's legs, moving higher up."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, hey, you start touching me there, I'm gonna start movin'! Word up, mother... ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "(interrupting) Shut up!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You a cop or something?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "Or somethin'.",
        "followup" : "Lafontaine backs off, pulling the gun away from Carter's head."
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "Okay. Carter straightens himself.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "relationship, stickin' a gun to a man's head, feelin' around his personal equipment. Make him think you don't trust him. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "I don't trust anybody. Especially first time deals.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I oughta pat your ass down. Make sure you're not a cop.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "Nobody touches me.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Shit, I ain't interested in puttin' my hands on you. That does nothin' for me. No. I don't need to be pattin' no ass. All I'm sayin' is, how do I know you're not a cop?",
        "followup" : "Lafontaine opens the trunk of the JAGUAR. Inside are MANY SMALL WRAPPED PACKAGES with U.S. ARMY stenciled on them."
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "Because cops don't have the U.S. Government's finest...at my prices. Carter looks at the merchandise.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Ooooh. That's pretty. ",
        "followup" : ""
      } ],
      "key_words" : [ "MAN'S VOICE", "CARTER", "ARMY", "JAMES CARTER", "LAFONTAINE", "MANY SMALL WRAPPED PACKAGES", "GUN", "JAGUAR", "HENRY LAFONTAINE", "I'" ]
    } ]
  }, {
    "id" : 12,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "DINER BATHROOM-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "JOHNSON is sitting in a stall, headphones on, talking into a transmitter.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "OK, Carter, gimme something here. Start with the color of the packaging.",
        "followup" : ""
      } ],
      "key_words" : [ "JOHNSON", "OK" ]
    }, {
      "id" : 1,
      "on" : "ON CARTER",
      "desc" : "He sticks a pinky in one ear and scratches. INSERT A TINY MICROPHONE is in Carter's ear.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "Yeah...beautiful. What would you call that paper there? Kind of a...Robin egg blue color? ON JOHNSON",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "JOHNSON",
        "line" : "(into the mike) Good. That's standard military packaging for plastique. Get a look under it. ON CARTER He leans over the packages and slits one open.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "You know something? Every time I see this stuff, it reminds me of...uh...a double latte grande... (still looking) With two shots of non-fat milk.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LAFONTAINE",
        "line" : "What are you talking about? ON JOHNSON",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "JOHNSON",
        "line" : "(into the mike) That's it. High intensity C-4. We got his ass.",
        "followup" : "CLICK. Carter looks up at a cute little silver plated .38 that Lois is pointing down on her from the next stall."
      }, {
        "shot_id" : 1,
        "character" : "LOIS",
        "line" : "Step out slowly. Or I'll blow your hair style into the toilet. Where it belongs. ON CARTER He sees a wire coming out of one side of the package.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "(speaking loudly) What's this little green wire coming out one side of the package?",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LAFONTAINE",
        "line" : "I wouldn't touch that if I were you. Lafontaine pulls a remote DETONATOR out of his pocket.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LAFONTAINE",
        "line" : "I get the money, you get the detonator. (smiles) First date's are always scary. Lafontaine shuts the trunk. Hands the keys to Carter.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "HESS",
        "line" : "on the sidewalk. I'll leave the detonator on my side. Then we trade places. Get the picture?",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LOIS VO",
        "line" : "Hey, honey...",
        "followup" : "Lafontaine turns to see Johnson, who's wearing a sexy short skirt, walking toward them with Lois bringing up the rear."
      }, {
        "shot_id" : 1,
        "character" : "LOIS",
        "line" : "She talks to herself on the potty.",
        "followup" : "Lois shoves Johnson ahead, revealing the GUN in one hand and Johnson's TRANSMITTER in the other."
      }, {
        "shot_id" : 1,
        "character" : "LOIS (cont'd)",
        "line" : "(to Lafontaine ) Let's kill her. (cocking the .38) I'll flip you for it.",
        "followup" : "Lafontaine turns to Carter, but Carter is already throwing a punch. Connecting. Lafontaine falls. The remote drops as Lois FIRES at Carter. The bullet ricochets off the car. Lafontaine sees the remote, makes a dive for it. But another hand gets there first. Lois turns the gun on Johnson."
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "No!",
        "followup" : "Carter is holding the detonator. Stand-off. Carter grabs Lafontaine. Pulls him up. Lois grabs Johnson, pulls her back by her hair, shoves the gun to her head. She's going to shoot anyway."
      }, {
        "shot_id" : 1,
        "character" : "LAFONTAINE",
        "line" : "Lois, don't!",
        "followup" : "Lois has the look of a child who hates to be told she can't do something. Johnson looks at Carter. She offers the best I'm sorry she can muster with her eyes."
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "Put the gun down.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LOIS",
        "line" : "After you're dead. I promise. Carter tightens his grip around Lafontaine's throat.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "Okay, look, we're gonna make a trade. You cross the street, leave her on the sidewalk. I will leave him on this him, I get her. Get the picture, Lois?",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LAFONTAINE",
        "line" : "(to Lois) Do it! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "LAFONTAINE", "DETONATOR", "LOIS", "TRANSMITTER", "LOIS VO", "GUN", "FIRES", "ON JOHNSON", "TINY MICROPHONE", "JOHNSON", "INSERT", "CLICK", "HESS", "ON CARTER", "I'" ]
    } ]
  }, {
    "id" : 13,
    "transition" : "",
    "position" : "EXT.",
    "place" : "DOWNEY BLVD",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lois leads Johnson across the street. Gun to her side. When she gets to the sidewalk, she turns, looks back at Carter. He's on the opposite side, holding Lafontaine. Lois starts back across the street. Dodging traffic. And Carter does the same, detonator in hand. Carter and Lois cross toward each other. HORNS HONK. But getting hit by a car is the least of their worries. They stare at each other as they cross traffic. Lois wants to kill Carter. She's got that look. Johnson and Lafontaine wait on opposite sides. Then as Carter and Lois are almost opposite each other --",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "Kill him!",
        "followup" : "Lafontaine starts running. Carter moves. Lois starts shooting. Hitting cars, smashing windshields. Cars careen into each other. Carter jumps over one, almost hit by another. Lois is in the middle of the street, firing at Carter. Another windshield hit. Car swerving. Carter falls, the detonator skidding away. Across the lane. Carter is in direct line of fire. And she takes aim as a TRUCK RUNS OVER THE DETONATOR. AN EXPLOSION roars in the parking lot. The Jaguar and SIX OTHER CARS go up in a ball of fire. Lois is knocked into the street. The diner windows ALL BLOW OUT AT ONCE. Carter SEES Lafontaine running for a car stopped on the street. Lafontaine pulls open the door, grabs the driver. Then Lafontaine looks up and SEES -- Carter APPEARING THROUGH THE SMOKE. Running toward him. Lafontaine drops the driver, swings at Carter, but Carter tackles him, slamming him into the car. Lafontaine tries to throw a punch. But Carter spins him around and shoves him into the car window, head first. Window shattering. Lafontaine is out. Carter pulls him out of the car. Lafontaine slumps. Carter kneels next to him, pulling out his identification."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Los Angeles Police. You are under arrest. Anything you say may be used to put your ass in jail, you piece of",
        "followup" : "Carter sits down next to Lafontaine. He's tired and hurting. Johnson runs up, gun in hand."
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "You okay?",
        "followup" : "Johnson kneels down next to him. Her short skirt hikes up her legs. Carter looks at one of her thighs."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Not anymore.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Where'd you get it?",
        "followup" : "Carter looks at Johnson and points to his heart. She suddenly looks pissed."
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON (cont'd)",
        "line" : "Oh, give it up! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "TRUCK RUNS", "SEES", "HORNS HONK", "LAFONTAINE", "ALL BLOW OUT AT ONCE", "SIX OTHER CARS", "JOHNSON", "AN EXPLOSION", "APPEARING THROUGH THE SMOKE", "OVER THE DETONATOR" ]
    } ]
  }, {
    "id" : 14,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE RESIDENCE",
    "time" : "MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A large entrance to the Ambassador's Residence. Han is waiting by the door, briefcase in hand, as Soon Young sweeps down the grand stairway, backpack over one shoulder, lunch bag in hand. She stops at the bottom of the stairs.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "SOON YOUNG",
        "line" : "I forgot -- (races back upstairs) -- something.",
        "followup" : "Han starts to protest, but... what's the use? He looks at his watch. Then up at Chi-Ying as she comes down the stairs."
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Will somebody please tell our daughter that I am the Ambassador?",
        "followup" : "Chi-Ying just shrugs. Nothing can be done about it. "
      } ],
      "key_words" : [ "SOON YOUNG", "HAN" ]
    } ]
  }, {
    "id" : 15,
    "transition" : "",
    "position" : "EXT.",
    "place" : "CHINESE CONSULATE RESIDENCE, LOS ANGELES",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "ESTABLISHING. FLAG of PEOPLES REPUBLIC OF CHINA hanging from a standard. A MERCEDES waiting in front. DRIVER and BODY GUARD with the car. Han and Soon Young finally appear. Heading for the car. Soon Young gets into the back seat. And just as Han is about to get in next to her, Chi-Ying comes out after him. CHI-YING Telephone. China. The Ambassador holds up his hands in exasperation. What's a guy to do? ",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Drop her off, then come back. (to Body Guard) Go with them. (to Soon Young) I love you.",
        "followup" : "Han kisses Soon Young on the cheek, then gets out of the car and rushes back into the house. Chi-Ying waves to Soon Young as the car pulls out of the driveway. "
      } ],
      "key_words" : [ "MERCEDES", "YING", "ESTABLISHING", "BODY GUARD", "HAN", "CHI", "DRIVER", "PEOPLES REPUBLIC OF CHINA", "FLAG" ]
    } ]
  }, {
    "id" : 16,
    "transition" : "",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE RESIDENCE",
    "time" : "MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Han puts down his briefcase, picks up the phone.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "(into phone; in Chinese) This is Han... (in English) Hello? Hello?",
        "followup" : "Nothing. Han replaces the phone with a troubled expression. "
      } ],
      "key_words" : [ "HAN" ]
    } ]
  }, {
    "id" : 17,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "STREETS OF BEVERLY HILLS",
    "time" : "MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The MERCEDES makes its way down tree-lined streets. Houses, cars, very few people -- this is a very affluent neighborhood. It turns onto a bridge leading down into the Beverly Hills FLATS. A WELCOME TO THE CITY OF BEVERLY HILLS sign flashes past. ",
      "sentences" : [ ],
      "key_words" : [ "MERCEDES", "WELCOME TO THE CITY OF BEVERLY HILLS", "FLATS" ]
    } ]
  }, {
    "id" : 18,
    "transition" : "",
    "position" : "INT.",
    "place" : "MERCEDES/REAR SEAT",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Soon Young leans forward and inserts a CD into the deck. As the music comes on she flips the dial to maximum -- total chaos. The sounds of R&B/HIP HOP fill the car. FRONT SEAT The Bodyguard and driver look at one another -- what is that racket? The bodyguard turns around and reaches through the partition lowering the volume. Soon Young turns the music back up. The bodyguard reaches through and turns it down again. She leans forward, pushing the bodyguard away and turns the music back up. A staring contest. She slams the privacy glass shut in his face. The bodyguard shakes his head turns back around. ",
      "sentences" : [ ],
      "key_words" : [ "CD", "HIP HOP", "FRONT SEAT" ]
    } ]
  }, {
    "id" : 19,
    "transition" : "",
    "position" : "EXT.",
    "place" : "BEVERLY HILLS FLATS",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The Mercedes turns onto Wilshire Boulevard where cars are backed up at least two blocks. Farther ahead, a PIGGY BACK OIL TRUCK has jack knifed and turned over, blocking traffic in both directions. Cops mill around trying to create order out of chaos. The driver checks the rearview: Too late, more cars stacking behind him. Up ahead an ASIAN traffic cop diverts cars onto Dayton Way. The driver nudges the bodyguard, points at the wreck.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "DRIVER",
        "line" : "(in Mandarin) LA drivers.",
        "followup" : "The car inches onto Dayton Way. A SECOND TRAFFIC COP directs them onto Rodeo. As the Mercedes pulls alongside him, the bodyguard notices he's Asian too. "
      } ],
      "key_words" : [ "SECOND TRAFFIC COP", "PIGGY BACK OIL TRUCK", "LA", "DRIVER", "ASIAN" ]
    } ]
  }, {
    "id" : 20,
    "transition" : "",
    "position" : "EXT.",
    "place" : "RODEO DRIVE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A DELIVERY VAN waits as the Mercedes stops at the corner. The passenger door opens and an Asian MAN slides out, traffic cop uniform, white gloves, glasses, hat pulled low. ",
      "sentences" : [ ],
      "key_words" : [ "MAN", "DELIVERY VAN" ]
    } ]
  }, {
    "id" : 21,
    "transition" : "",
    "position" : "INT.",
    "place" : "REAR SEAT",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Soon Young barely pays attention as she watches the cop knock on the bodyguard's window. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 22,
    "transition" : "",
    "position" : "EXT.",
    "place" : "MERCEDES",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The bodyguard cautiously lowers the glass.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "BODYGUARD",
        "line" : "Yes, officer?",
        "followup" : "The Cop leans in as if to speak, BOOM! Blows him away. The bodyguard slumps forward. BOOM! The driver gets it. We see now the cop is SANG. IN THE REAR Soon Young is shocked but she thinks fast, scoots across the seat as Sang jerks the door open. She flies out the other door, he manages to get a handful of backpack, she quickly wriggles free, slams the door shut behind her and starts running. "
      } ],
      "key_words" : [ "SANG", "BOOM", "BODYGUARD", "IN THE REAR" ]
    } ]
  }, {
    "id" : 23,
    "transition" : "",
    "position" : "EXT.",
    "place" : "MERCEDES/STREET",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "She turns around, sees Sang making his way OVER the car. She runs through traffic towards a shopping structure, 2 Rodeo Dr. Sang curses when he sees he can't reach her and heads back to the van. ",
      "sentences" : [ ],
      "key_words" : [ "OVER" ]
    } ]
  }, {
    "id" : 24,
    "transition" : "",
    "position" : "EXT.",
    "place" : "STREET/2 RODEO DRIVE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Soon Young runs around the corner breathing hard. She hugs the edge of the building. Peeks back around. Sees a van making a sharp U-turn, headed her way. She starts across the cobblestones. BEHIND HER, a MOTORCYCLE pulls out. She's in the middle of the street. The biker scoops her up under his left arm, pulls onto Rodeo. THE DELIVERY VAN Screeches up.",
      "sentences" : [ ],
      "key_words" : [ "THE DELIVERY VAN", "MOTORCYCLE", "BEHIND HER" ]
    }, {
      "id" : 1,
      "on" : "ON SANG",
      "desc" : "He jumps out and opens the back of the van. Soon Young takes a SWING AT HIM. Sang grabs her arm easily and then viciously PUNCHES HER, sending her flying back into the van. Sang slams the doors. Trots to the front. They pull out. LITTLE SANTA MONICA -- the van and motorcycle head off in separate directions. ",
      "sentences" : [ ],
      "key_words" : [ "LITTLE SANTA MONICA", "PUNCHES HER", "SWING AT", "HIM" ]
    } ]
  }, {
    "id" : 25,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "CHINESE CONSULATE COMPOUND",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "UNMARKED CARS roar down the road, racing up to the residence. TWO CARS stay on the street outside. SEVERAL MEN IN SUITS get out, head for the residence. Some lugging equipment. In the lead is AGENT IN CHARGE, WARREN RUSS. The door opens, they enter. ",
      "sentences" : [ ],
      "key_words" : [ "TWO CARS", "SEVERAL MEN IN SUITS", "UNMARKED CARS", "AGENT IN CHARGE", "WARREN RUSS" ]
    } ]
  }, {
    "id" : 26,
    "transition" : "",
    "position" : "INT.",
    "place" : "AMBASSADOR'S RESIDENCE",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Ambassador Han greets them. He has obviously been through great strain, but maintains his composure.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Ambassador, I'm Warren Russ, FBI Agent in Charge. This is Agent Whitney.",
        "followup" : "DAN WHITNEY, thirty-eight, ex-football type, solid American, shakes hands with the Ambassador."
      }, {
        "shot_id" : 0,
        "character" : "RUSS (cont'd)",
        "line" : "I know this is a difficult time but...",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "(interrupting) You can set up in my office. ",
        "followup" : ""
      } ],
      "key_words" : [ "HAN", "RUSS", "FBI", "DAN WHITNEY", "I'" ]
    } ]
  }, {
    "id" : 27,
    "transition" : "",
    "position" : "INT.",
    "place" : "OFFICE",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Office off the main entrance. Elegantly furnished. Chinese Flag. Political photographs. The FBI is already setting up equipment. Tapping phone lines. Han watches them for a moment as his personal life is pushed aside and the Feds take over. Then he approaches Russ.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I would like one of my people to help.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Ambassador, let me assure you that the FBI has made this a top priority. We have plenty of manpower on the case.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "He is very good.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "As I said, sir, we've got all the people we need. Russ turns away.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I am not an American, Mr. Russ. My daughter is not an American.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "I understand, sir. But you are an honored guest of the United States...",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "(interrupting) He is already on the plane. I hope you will treat him with the same respect you have shown me.",
        "followup" : "Russ stares at Han, not sure how to handle this situation. Mr. Han bows and exits. Leaving Russ at a loss. Whitney comes up behind him."
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "What was that all about?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "He wants his own man.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "What?! ",
        "followup" : ""
      } ],
      "key_words" : [ "WHITNEY", "RUSS", "FBI", "HAN" ]
    } ]
  }, {
    "id" : 28,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "LAPD-DAY",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The entrance is UNDERGROUND and very busy. Carter and Johnson pull up in the sedan. ",
      "sentences" : [ ],
      "key_words" : [ "UNDERGROUND" ]
    } ]
  }, {
    "id" : 29,
    "transition" : "",
    "position" : "INT.",
    "place" : "DETECTIVE DIVISION ROOM",
    "time" : "L.A.P.D. DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Overloaded DETECTIVES at desks. Trying to solve too many crimes in a city with too many bad people. Din of PHONES, KEYBOARDS, VOICES. A pissed off Johnson enters in front of Carter.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You're killin' me here.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Carter, just because you saved my butt, doesn't mean it's yours.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh, baby, you cruel...",
        "followup" : "Johnson enters a small office right across from Carter's desk where he now plops down. TWO DETECTIVES walk up."
      }, {
        "shot_id" : 0,
        "character" : "FIRST DETECTIVE",
        "line" : "Heard about what happened over there at the diner. Nice work.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SECOND DETECTIVE",
        "line" : "(laughing) Not everybody gets to blow up a city block.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FIRST DETECTIVE",
        "line" : "Don't worry about it. Nobody liked the food there anyway.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SECOND DETECTIVE",
        "line" : "Probably give you a medal. For urban renewal. Both Detectives slap hands and laugh.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That's good. What did you two do? Work that up in the men's room while you were playing with each other?",
        "followup" : "The cops stop laughing. They walk away when Carter's phone rings."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Carter... Yeah... uh-huh...now? Okay. He hangs up and looks at Johnson in her office.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Captain wants to see me.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "(melting) Last night's as much my fault as yours. If he's gonna put the blame on anybody --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, I was senior. It's OK. This is why I get the big bucks.",
        "followup" : "Carter gets up and crosses toward the CAPTAIN'S OFFICE in the corner of the room. A brave man facing the Lion's den. Even Johnson can't help but admire his courage. "
      } ],
      "key_words" : [ "CARTER", "TWO DETECTIVES", "FIRST DETECTIVE", "DETECTIVES", "KEYBOARDS", "CAPTAIN'S OFFICE", "JOHNSON", "PHONES", "OK", "VOICES", "SECOND DETECTIVE" ]
    } ]
  }, {
    "id" : 30,
    "transition" : "",
    "position" : "INT.",
    "place" : "CAPT. DIEL'S OFFICE",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "WILLIAM DIEL is behind his desk. Diel is fifty, professional, doesn't smile a lot. He's not smiling now. Carter enters.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "DIEL",
        "line" : "I don't know what went wrong last night, but this department could've lost one detective and our only explosives expert.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Sir, I can explain.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "DIEL",
        "line" : "What you did was dangerous and completely outside policy.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I know, but --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "DIEL",
        "line" : "That's probably the only reason Johnson's still alive. This takes Carter a little by surprise.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "DIEL",
        "line" : "Good job.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, sir, it was a pleasure to preserve Johnson's ass. (pause) Well...you know what I mean. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "DIEL",
        "line" : "I got a call from the F.B.I. The daughter of the Chinese Ambassador has been kidnapped and they asked for help. You're it. Carter straightens his posture a bit.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Feds asked for me?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "DIEL",
        "line" : "They asked for the best street man I had. Carter tries to be humble, but... damn, that's hard.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "And that, of course, would be me.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "DIEL",
        "line" : "Don't push it. You better watch your ass with these Fed types. If there's a screw-up, they won't think twice about burnin' it. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "DIEL", "WILLIAM DIEL" ]
    } ]
  }, {
    "id" : 31,
    "transition" : "",
    "position" : "INT.",
    "place" : "DETECTIVE DIVISION ROOM",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter exits Diel's office, crosses back through the desks to his own. Johnson comes out of her office.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "What happened? Carter just packs up his stuff.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Did he fire you? He can't fire you! Carter puts a hand on her shoulder.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, baby, it's cool. Captain just reassigned me to the Feds. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "The Feds?!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "FBI needs a taste of the street. And I'm it. Carter returns to packing up his stuff.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Way he put it, I was the only one he thought could handle it. But you know what the worst thing is? ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "(caught up in it) No...what?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I could get promoted right out of here.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "What's wrong with that?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I wouldn't be close to you. (sniffing) What is that perfume, girl? Johnson comes back to reality.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "No matter how many times you go undercover, you still come out an asshole. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "FBI", "JOHNSON", "I'" ]
    } ]
  }, {
    "id" : 32,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Unmarked car pulls up in front of the Chinese Consulate. Carter sticks his badge out the window to FBI Agents. Carter is wearing shades. ",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Detective James Carter. L.A.P.Deee.",
        "followup" : "One of the Agents relays the information via his radio. Then they open the gates. Carter drives in. "
      } ],
      "key_words" : [ "CARTER", "FBI" ]
    } ]
  }, {
    "id" : 33,
    "transition" : "",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE RESIDENCE",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter enters. The place is under FBI control. But everything's gonna be okay now. Carter's here. Carter is the only one not in a dark suit. Interviews of all staff being conducted in one room - we get a glimpse as a door opens and an AGENT with an EAR PLUG exits. Carter gives the Agent a knowing nod.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(re: ear plug) Oh yeah, gotta get me one a those.",
        "followup" : "Sees ANOTHER FBI AGENT with a high-powered rifle move past."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Ooo, there's a chill. Love that.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "Carter.",
        "followup" : "Carter sees Whitney motioning him into the office. "
      } ],
      "key_words" : [ "AGENT", "ANOTHER FBI AGENT", "WHITNEY", "CARTER", "EAR PLUG", "FBI" ]
    } ]
  }, {
    "id" : 34,
    "transition" : "",
    "position" : "INT.",
    "place" : "HAN'S OFFICE",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter enters. Lots of activity. All electronic equipment is up and running. AGENTS are testing the PHONE TAPE. Russ is on the phone as Carter walks up.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(into phone) ...yes, sir, I understand. I'll do my best...but there is a question of authority, sir... yes, sir, okay.",
        "followup" : "Russ hangs up. Turns to Carter. Carter nods. Confident that Russ knows he's the man for the job."
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Carter. I'm Russ. Agent in charge.",
        "followup" : "Carter eyes him. The suit, the hair, the shine on the shoes. Russ holds out his hand. They shake."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Any demands yet?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "At this point we don't have much. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "RUSS (ignoring him) You come highly recommended, Carter. And your particular assignment requires a special talent.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Interrogation is one a my specialties, but undercover work is my forte.",
        "followup" : "Everything about Carter changes; posture, language, attitude, as he morphs into a gang drug supplier."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yo, bro, y'cruisin' fo da go-dee on da hi, u be comin' to da ri-man, say what. [or something to this effect]",
        "followup" : "Russ stares at Carter for a moment. Carter quickly changes back to himself."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Never knew I was a man in blue. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "RUSS", "PHONE TAPE", "AGENTS", "I'" ]
    } ]
  }, {
    "id" : 35,
    "transition" : "",
    "position" : "",
    "place" : "EXT. CHINESE CONSULATE RESIDENCE",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ and Carter exit.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "... the director considers this top priority, considering he is a Chinese National and here under difficult circumstances. His name is Lee. And he is to be shown every courtesy. Within reason.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Sir, he's just gonna get in my way. If I'm gonna handle this situation...",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(interrupting) He is the situation. Carter stops walking.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'm talking about the girl.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Don't worry about the kidnapping, Carter, the F.B.I. will handle that. Your assignment is Lee. Carter hesitates a moment, trying to sort this thing out. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "What kind of assignment is that? Bottom line: I don't want some Chung King Cop getting his head blown off and turning this operation into a international incident. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(getting hot) Why don't you assign one of your own men to this?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Because with your special talents, I'm sure you'll do a better job. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "What the hell am I supposed to do with him? Take him to the zoo?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Just make him think you're following leads. Interview some suspects, look at fingerprints, do detective shit. I don't care. I just don't want to see him- or you, for that matter- until this is resolved. (hands Carter a file) Now, we want to make a good impression, don't we? His plane lands in an hour. Don't be late.",
        "followup" : "End of conversation. Russ returns to the house. Carter sizzles. "
      } ],
      "key_words" : [ "CARTER", "RUSS", "I'" ]
    } ]
  }, {
    "id" : 36,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "LOS ANGELES INTERNATIONAL AIRPORT",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter's unmarked car pulls into one of the POLICE ZONES. ",
      "sentences" : [ ],
      "key_words" : [ "POLICE ZONES" ]
    } ]
  }, {
    "id" : 37,
    "transition" : "",
    "position" : "INT.",
    "place" : "CARTERS UNMARKED CAR",
    "time" : "PARKED CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter looks at his watch. His mobile phone rings.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah. INTERCUT WITH JOHNSON She's at her desk.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "So how'd it go? Carter perks up when he hears Johnson's voice.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "How'd what go?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "With the FBI. What do you think I'm talking about? Carter puts on some exuberance.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh, you're not gonna believe what they put me in charge of. They sent for the Ambassador's personal Chinese Investigator type. He is like the baddest Asian shield they got. And I, let me repeat that, I am the man who is on the case with him. Just the two of us, alone, workin' the whole deal as a team.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "They put you in charge?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "In Charge. Just me'n him. No interference. They don't even want to hear from us until we're done. I love the F.B.I. I love the F.B.I.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Well...listen, if you need any help, you know, back up, call me, OK? ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh baby, don't worry, I'll call you. You can count on it.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "OK. Well...make us proud. And be careful.",
        "followup" : "That takes a little of the wind out of Carter's sails. We can see it in his face, but he tries his best not to let her hear it over the phone."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah, thanks. He hangs up and mutters to himself.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Yeah, gotta be careful. Might get run over by a Sky Cap. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "FBI", "INTERCUT WITH JOHNSON", "JOHNSON", "OK", "I'" ]
    } ]
  }, {
    "id" : 38,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "LAX",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The CHINESE AIRLINES JET lands. ",
      "sentences" : [ ],
      "key_words" : [ "CHINESE AIRLINES JET" ]
    } ]
  }, {
    "id" : 39,
    "transition" : "",
    "position" : "INT.",
    "place" : "LAX TERMINAL",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter is waiting at the GATE, the only one who could bypass Customs. He's watching a parade of ASIAN PASSENGERS deplane, heading for Customs.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Mr. Lee. Is there a Mr. Lee on the (no response) Does anybody know Mr. Lee? (no response) Mr. Lee from China.",
        "followup" : "Carter is losing his patience. Passengers continue to deplane. But their ranks are thinning."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Mr. Lee.",
        "followup" : "Finally the last of the last. An ELDERLY ASIAN MAN AND WOMAN."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Mr. and Mrs. Lee? They look at him, smile, but continue past.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I don't believe this! First I get stuck with this --",
        "followup" : "LEE moves down the ramp and stops as he HEARS CARTER'S VOICE --"
      }, {
        "shot_id" : 0,
        "character" : "CARTER'S VOICE",
        "line" : "-- lame ass assignment, now the sonuvabitch doesn't even show up. This is bullshit! Ain't my fault if this limpdick can't make his plane.",
        "followup" : "Carter is about to leave when Lee exits the ramp. Looking at Carter. And Carter looks at him."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Mr. Lee? Lee smiles and bows politely.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You got bags?",
        "followup" : "No response from Lee. Carter assumes he can't speak English."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Oh shit, you gotta be kiddin'. Carter holds out his FBI IDENTIFICATION.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You speaky Eng-lish? Lee looks at Carter for a moment, then smiles and nods.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah, right, sure, uh-huh. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "HEARS CARTER'S VOICE", "CARTER'S VOICE", "ELDERLY ASIAN MAN AND WOMAN", "GATE", "LEE", "FBI IDENTIFICATION", "ASIAN PASSENGERS" ]
    } ]
  }, {
    "id" : 40,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CAR",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "This is his first time to America. And despite the reason, he can't help but look.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "First thing I gotta do is check you in. So we have to go to L.A.P.D. H.Q. (checking Lee ) You understand what I'm saying? A beat, then Lee says:",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "(slowly) You talk very fast.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Okay, I'll slow down. (just as fast) So we go downtown and we ask you a few questions... you know, like what's your name? How old are you? You ever expose yourself in public...shit like that.",
        "followup" : "Carter waits to see if he's getting through. Lee just nods. Carter is convinced he's just talking to himself."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah, good, we also will ask if you have ever worn pink frilly underwear...and what the hell is the attraction of Karaoke to Asian Peoples?",
        "followup" : "Lee nods as if he understands everything. Carter sighs. It's gonna be a long assignment. Lee points to the RADIO."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You want the radio? RAY-DEE-OHHH. Lee nods.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Why not? Beats talking shit to myself.",
        "followup" : "Lee smiles, nods. Carter turns on the radio. A BEACH BOYS SONG comes on."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh no... Carter reaches for the radio, but Lee holds out his hand.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Beach Boy.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You're shittin' me. You know the Beach Boys?! Beach Boy America. (starts singing) Help me Rhonda, help me get her out of my -- Carter listens to Lee sing along for a moment, then --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Beach Boy America my ass. You don't look like a Beach Boy, you don't sound like a Beach Boy. And your singin' ability is only gonna make me do something that I could get the death penalty for. You want America, here's America.",
        "followup" : "Carter changes the station. RAP MUSIC. Carter drums along with the bass line. Moving his body to the beat, to make sure he shows the effect of the rhythm."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Tell me you can do this to the Beach Boys.",
        "followup" : "Lee listens, trying hard to get it. He doesn't. He pushes the other button back to HELP ME RHONDA."
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "(smiles) Help me Rhonda.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(incensed) Let me give you a piece of advice: never touch another man's radio. You do it again, nobody, not Rhonda, not Yolanda, gonna save your ass. Carter pushes the button back to Rap.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That is America, got it? That is America. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "DEE", "BEACH BOYS SONG", "RAY", "RAP MUSIC", "LEE", "HELP ME RHONDA", "RADIO", "OHHH", "I'" ]
    } ]
  }, {
    "id" : 41,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE",
    "time" : "HAN'S OFFICE DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Han is reviewing PHOTOGRAPHS with Whitney and Russ.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "-- operating out of San Francisco, has been associated with one of the Triads. This group was identified as having entered the United States two months ago --",
        "followup" : "The PHONE RINGS. Attention turns to the desk. Russ stands."
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(to Han) Remember: try and keep him on the phone as long as you can. Ask to speak with your daughter. Ask how she is... anything.",
        "followup" : "They cross to the desk. Han hesitates. Nervous. FOURTH RING. He picks up the phone."
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Hello.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "Han?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Yes.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "It's Griffin.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Griffin? Where are you.",
        "followup" : "Han turns to Russ. Russ mouths Do you know him? Han nods."
      }, {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Still in Hong Kong. But I'm afraid this is not a social call. I have just learned some disturbing information. There is going to be an attempt to kidnap you or a member of your family. I don't know when. And I'm not sure by whom. But I trust my sources. You should contact the F.B.I. immediately. They'll know what to do.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I am afraid your source was very good. They have Soon-Young.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Oh God, no. I'm so sorry, my friend. Russ picks up the phone.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "This is Special Agent Russ, Federal Bureau of Investigation. Would you please identify yourself? ",
        "followup" : ""
      } ],
      "key_words" : [ "PHOTOGRAPHS", "MAN'S VOICE", "RUSS", "FOURTH RING", "GRIFFIN", "HAN", "PHONE RINGS", "I'" ]
    } ]
  }, {
    "id" : 42,
    "transition" : "",
    "position" : "INT.",
    "place" : "HONG KONG APARTMENT",
    "time" : "BEDROOM NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Overlooking downtown Hong Kong. Griffin is next to the window, phone in hand, looking out at the lights of the city.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Yes, of course. My name is Thomas Ian Griffin, former commander of British I are old and close friends. He will confirm this. But the information I have just relayed to you is sensitive. I'm sure you understand that I cannot provide details over a telephone. But in lieu of Soon Young's...situation, I'll be on the next flight to Los Angeles. ",
        "followup" : ""
      } ],
      "key_words" : [ "GRIFFIN", "I'" ]
    } ]
  }, {
    "id" : 43,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "L.A.P.D. BUILDING",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter leads Lee toward the FRONT DESK. Holds up ID and motions to Lee.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "He's with me.",
        "followup" : "Lee looks at the OFFICER, offering a short bow and a polite smile. The Officer isn't used to such polite behavior. Can't help a smile back. Carter sees the exchange. Makes him wanna puke. He leads Lee to the ELEVATOR. They get in. "
      } ],
      "key_words" : [ "CARTER", "OFFICER", "ID", "FRONT DESK", "ELEVATOR" ]
    } ]
  }, {
    "id" : 44,
    "transition" : "",
    "position" : "INT.",
    "place" : "ELEVATOR",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter and Lee enter. Doors close. They're alone.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You carry a gun?",
        "followup" : "Lee looks at Carter as if questioning. Carter has no patience."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "A gun, a gun!",
        "followup" : "Carter reaches for his weapon, but suddenly Lee's hands move with lightening speed - and Carter is suddenly staring at HIS OWN GUN IN LEE'S HANDS."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "What're you doing?! I wasn't gonna shoot you! I was trying to explain -- ah shit, give me the god damn gun.",
        "followup" : "Lee hesitates, then smiles and gives the gun back. Carter fumes. Holds up his gun."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You have one of these?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "No.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(holstering the gun) Yeah, well you're in American now. Everybody's got guns. That tricky shit with your hands is gonna get your",
        "followup" : "Lee smiles. Carter turns away. They ride in silence. Suddenly Carter goes for his gun again. And Lee's hands fly into action. And once again -- Carter is staring at HIS OWN GUN IN LEE'S HANDS. Now Carter is really pissed. But Lee smiles and hands the gun back. Carter forces a smile. Takes the gun."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You try that shit on me one more time, I'll kick your ass. You understand that? You know what kick your ass means? Lee smiles, nods.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'll bet you do.",
        "followup" : "The ELEVATOR STOPS. Doors open. Carter motions politely for Lee to exit first and which direction to go. "
      } ],
      "key_words" : [ "CARTER", "LEE", "ELEVATOR STOPS", "HIS OWN GUN IN", "LEE'S HANDS", "HIS OWN GUN IN LEE'S HANDS", "I'" ]
    } ]
  }, {
    "id" : 45,
    "transition" : "",
    "position" : "INT.",
    "place" : "HALLWAY",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee exits. Carter comes out behind him. Takes a couple of steps. Passing OTHER DETECTIVES getting onto the elevators. Carter follows Lee, a step behind. Then he goes for his gun again. Lee, as if he has eyes in the back of his head, spins, kicks. And Carter is on his back, staring at the ceiling. Looking at his gun in Lee's hands. Lee holds out his hand to help Carter up. Suddenly we HEAR --",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "Put the gun down now!",
        "followup" : "Carter and Lee turn. A DETECTIVE has his gun leveled at Lee from ten feet away - obviously mistaking the situation."
      }, {
        "shot_id" : 0,
        "character" : "THE DETECTIVE",
        "line" : "Put it down!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "It's alright. He's with me.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "THE DETECTIVE",
        "line" : "With you? He's pointing a goddamn gun at you. You call that with you? And now it's Lee's turn to speak - in perfect English.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "He was just showing me how to take a gun away from a suspect.",
        "followup" : "Carter looks at Lee in disbelief. Lee flips the gun around and hands it back to Carter, butt first. Carter takes the gun, anger building. "
      }, {
        "shot_id" : 0,
        "character" : "THE DETECTIVE",
        "line" : "You must be a helluva teacher.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Oh yes, he's very good.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "THE DETECTIVE",
        "line" : "(to Carter) Just don't do that shit in the hallway. I could've killed him.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh yeah, maybe next time you will.",
        "followup" : "Lee smiles at the Detective and bows as they move past. The Detective can't help but return the smile. Carter is pissed. "
      } ],
      "key_words" : [ "MAN'S VOICE", "THE DETECTIVE", "OTHER DETECTIVES", "CARTER", "DETECTIVE", "LEE", "HEAR" ]
    } ]
  }, {
    "id" : 46,
    "transition" : "",
    "position" : "INT.",
    "place" : "MEN'S ROOM",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter bursts into the men's room. Lee follows him in.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You speak English!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "A little.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Bullshit a little. You lied to me.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I didn't say I didn't. You assumed I didn't.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "It's the same thing!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I am not responsible for your assumptions.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You're full of shit. Do you understand what I'm saying to you? Full of shit? ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Not being able to speak is not the same as not speaking. You seemed as if you liked to talk. I like to let people talk who like to talk. It makes it easier to find out how full of shit they are.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Okay, fine, you're full a shit, I'm full a shit.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "We are both full of shit.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah, that's right. Now that we understand each other... show me how you did that.",
        "followup" : "Carter pantomimes Lee's fast hands. Whipping them around in a frenzy of activity. Lee just watches Carter's pathetic attempt to mimic him for a moment, then:"
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "You should keep your gun. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "LEE", "I'" ]
    } ]
  }, {
    "id" : 47,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "AT CARTER'S DESK",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter is sitting on one side, Lee on the other. Carter is handing him a bunch of brochures and information.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "... and there's a copy of our insurance packages.",
        "followup" : "Carter hands another folder to Lee. Lee stares at the material. But it's obvious he's losing patience himself."
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I am afraid I don't understand the importance of this information.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Look, you want to work in this country, you gotta know this crap. Okay? We're gonna be in some deep shit here. Working the danger zone. And you need insurance. Cause, you know, you might be starting some riots and shit.",
        "followup" : "But Carter sees Johnson coming toward him. And he quickly puts on the positive."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "So, my plan is, we hit the scene, walk it --",
        "followup" : "Lee doesn't know what the hell Carter is talking about. Johnson glances at Lee, then Carter."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "-- and get the feel for how it went down. Then hit the witnesses --",
        "followup" : "Carter sees Johnson, smiles, waves. Lee turns to look, but Carter goes quickly back to talking, as if what he has to say is too important to interrupt."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "action went down.",
        "followup" : "Johnson watches for a moment, then she moves past. Realizing the conversation is too important to interrupt. But she smiles at Lee."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Because we gotta dig up the -- And Lee smiles at Johnson.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "-- what the hell is that?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "What?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That silly-ass look on your face.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I was being polite.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Well don't do that. Polite don't work here. You do that polite shit here in America, they'll sue your ass for harassment.",
        "followup" : "Lee just stares at Carter. America, according to Carter, is not what he expected. But now that Johnson is safely past:"
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Where were we?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Witnesses.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Wait. You hungry? You gotta be hungry, you just flew in from China. And what'd they feed you, Chinese food, right? Then you gotta be hungry. Hell, it doesn't matter, I'm hungry. We'll get some food on the way to the Consulate. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "LEE", "I'" ]
    } ]
  }, {
    "id" : 48,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "GRAUMAN'S CHINESE THEATRE",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A HOT DOG STAND out in front. Carter is handed TWO HOT DOGS by the COOK. Gives one to Lee.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "It's not really dog. Just called a dog. Not like in Vietnam where if they made one a these it'd be dog. It's just made from... well, I'm not sure what, but there ain't no dog in it.",
        "followup" : "They move down the street and Carter gestures to the wild quasi-Chinese architecture of the old Grauman Theatre."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Just like home, huh? I never been to China, but... (looks at Lee) ... I guess this must be pretty much it, huh? Dragons and shit. Lee just stares at the garish design. He is not happy.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I thought you were taking me to the consulate. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh yeah, but this is on the way. And you gotta see John Wayne's footprints. Everybody does. It's almost like a law. You can't believe how small his feet were for a dude that big. Tiny god damn feet!",
        "followup" : "Carter leads Lee to the foot prints in cement. But a BUS LOAD OF ASIAN TOURISTS starts to move in, swirling around. Carter looks at the foot prints for a beat, really getting tired of this job. Then he turns to Lee and... is CONFRONTED BY THE BUS LOAD OF ASIANS. Lee is no where to be seen."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Lee? (no Lee) Lee!",
        "followup" : "A COUPLE of the ASIAN TOURISTS turn to him. Carter starts searching through the tourists. Trying to pick him out. Lee moves quickly through the Asians, smiling and commenting on the concrete memorials, just like he's a tourist. And Carter can't pick him out."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Lee!",
        "followup" : "Carter suddenly sees him. His back to us. Grabs him from behind and spins him around."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, I was callin' -- Then he realizes it's not Lee.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Shit! Where'd he go?! LEE!",
        "followup" : "As Carter turns and confronts more ASIAN FACES, we SEE LEE slip past him in the b.g. This ain't funny, man. I know you're in there! Carter turns, SEES ANOTHER BUS LOAD OF ASIAN PEOPLE unloading."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh no, man, no!",
        "followup" : "Carter pushes through the tourists. And finally SEES Lee across the street, hailing a cab. Carter can't believe it."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey! What're you doin'?!",
        "followup" : "Lee turns, sees Carter. The cab is still too far away to get into. So Lee goes running after it."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey! Hey!",
        "followup" : "Carter takes off after him. "
      } ],
      "key_words" : [ "SEE LEE", "HOT DOG STAND", "CARTER", "CONFRONTED BY THE BUS LOAD OF", "ASIAN TOURISTS", "SEES ANOTHER BUS LOAD OF ASIAN PEOPLE", "ASIANS", "COUPLE", "COOK", "BUS LOAD OF ASIAN TOURISTS", "SEES", "TWO HOT DOGS", "LEE", "ASIAN FACES", "I'" ]
    } ]
  }, {
    "id" : 49,
    "transition" : "",
    "position" : "EXT.",
    "place" : "HOLLYWOOD BLVD",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee darts right across traffic - gymnastically moving through the flow of traffic. HORNS HONK. A car skids to a stop, almost hitting him, but Lee vaults over it. Carter sees the maneuver, can't believe it. Continues after him, trying not to get flattened.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Come back here!",
        "followup" : "Lee grabs onto the back of a MOVING BUS, climbs up on top. FROM ATOP THE BUS Lee looks back at Carter. Carter is pouring on the speed, catching up to the bus. He's going to catch Lee. Lee looks off the side at ANOTHER BUS COMING THE OPPOSITE DIRECTION. CARTER lunges at the bus, grabbing hold."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Don't do this! You're gonna get hurt! We're going to the Consulate, right now, I swear --",
        "followup" : "Carter climbs up just in time to see -- LEE -- leap from the bus to the OTHER BUS moving in the opposite direction. He lands hard, grabbing hold. CARTER opposite direction. Carter starts back down the bus as fast as he can, jumping the last four feet, right into the path of a CAR, which swerves to avoid hitting him, into the path of ANOTHER CAR. HORNS HONK. CARS SWERVE. Carter runs down Hollywood Blvd. toward La Brea as we SEE -- LEE -- JUMP ONTO THE TOP OF A MOVING VAN which is next to the Bus. Then jumps from the VAN to a GARBAGE TRUCK just making the turn down La Brea. Disappearing around the corner. "
      } ],
      "key_words" : [ "CARS", "CARTER", "MOVING VAN", "VAN", "OTHER BUS", "HORNS HONK", "JUMP ONTO THE TOP OF", "ANOTHER", "SWERVE", "LEE", "FROM ATOP THE BUS", "GARBAGE TRUCK", "SEE", "ANOTHER CAR", "BUS COMING THE OPPOSITE DIRECTION", "CAR", "MOVING BUS" ]
    } ]
  }, {
    "id" : 50,
    "transition" : "",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "HOLLYWOOD AND LA BREA AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter reaches the corner in time to watch the Garbage Truck heading toward Sunset Blvd. But he can't give up. What would he tell Russ? He lost his assignment? He starts running after the Garbage Truck. And as Carter runs past CAMERA CRANES ACROSS TO ANOTHER DELIVERY TRUCK moving the opposite direction. And ON TOP OF THE DELIVERY TRUCK is Lee, staying low, watching Carter run his poor tired ass off in the wrong direction. Lee looks around quickly. A YELLOW CAB is moving down the cross street. ",
      "sentences" : [ ],
      "key_words" : [ "CAMERA CRANES ACROSS TO ANOTHER DELIVERY TRUCK", "ON TOP OF THE DELIVERY TRUCK", "YELLOW CAB" ]
    } ]
  }, {
    "id" : 51,
    "transition" : "",
    "position" : "INT.",
    "place" : "YELLOW CAB",
    "time" : "AFTERNOON",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The DRIVER is cruising when a MAN seems to DROP from the sky right in front of him. The Driver slams on the brakes and skids to a stop at a smiling Lee. ",
      "sentences" : [ ],
      "key_words" : [ "DRIVER", "MAN", "DROP" ]
    } ]
  }, {
    "id" : 52,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "CHINESE CONSULATE",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The taxi pulls up in front and Lee exits. Heads for the entrance. TWO FBI AGENTS (WILLIS and GEIGER) watching. One speaks into a HEADPHONE.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "FBI AGENT WILLIS",
        "line" : "(into headset) We have a man in a taxi. License plate 2NRB 998. About five ten. Asian. ",
        "followup" : ""
      } ],
      "key_words" : [ "WILLIS", "FBI AGENT WILLIS", "HEADPHONE", "FBI AGENTS", "TWO", "GEIGER", "NRB" ]
    } ]
  }, {
    "id" : 53,
    "transition" : "",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE",
    "time" : "HAN'S OFFICE CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Whitney gets the call. Turns to Russ. Coffee cups and take out food spread around.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "Got someone dropped off by a cab. Asian.",
        "followup" : "Everyone perks up. "
      } ],
      "key_words" : [ "WHITNEY" ]
    } ]
  }, {
    "id" : 54,
    "transition" : "",
    "position" : "EXT.",
    "place" : "CHINESE CONSULATE ENTRANCE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "FBI Agent Geiger stops Lee.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "FBI AGENT GEIGER",
        "line" : "Can I help you?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Help. Yes. I must see the Ambassador.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FBI AGENT GEIGER",
        "line" : "About what?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "May I please see him? It is very important. FBI Agent Willis walks up.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FBI AGENT WILLIS",
        "line" : "Why don't you tell us why you need to see the Ambassador? We'll decide if it's important.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "It is about his daughter, Soon Young. That's the magic word. Things happen fast.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FBI AGENT GEIGER",
        "line" : "Hands on top of your head!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FBI AGENT WILLIS",
        "line" : "(into head set) He asked about the Ambassador's daughter. FBI Agent Geiger reaches for his gun. And Lee reacts. ",
        "followup" : ""
      } ],
      "key_words" : [ "FBI AGENT WILLIS", "FBI AGENT GEIGER", "FBI", "LEE" ]
    } ]
  }, {
    "id" : 55,
    "transition" : "",
    "position" : "",
    "place" : "INT. CHINESE CONSULATE",
    "time" : "HAN'S OFFICE CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "WHITNEY He asked about the daughter.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Get em!",
        "followup" : "BACK TO LEE AND THE TWO AGENTS Both agents are on the ground looking up at Lee who is holding their guns. Wondering what happened. And sure they are about to die."
      }, {
        "shot_id" : 0,
        "character" : "FBI AGENT GEIGER",
        "line" : "(into head set) Code nine, code nine!",
        "followup" : "The agents are frozen, fear on their faces. It looks like Lee is going to kill them. But suddenly he throws their guns into the bushes."
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "You just don't understand. I was invited.",
        "followup" : "Lee moves toward the entrance and SEES SIX MORE AGENTS coming at him. Lee can't believe it. What is going on?!"
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "There he is!",
        "followup" : "Lee darts across the driveway and around the corner of the house."
      } ],
      "key_words" : [ "WHITNEY", "RUSS", "BACK TO LEE AND THE TWO AGENTS", "FBI AGENT GEIGER", "SEES SIX MORE AGENTS", "LEE" ]
    }, {
      "id" : 1,
      "on" : "ON LEE",
      "desc" : "He runs across a patio. Suddenly, a side door on the house opens and TWO AGENTS run into his path. WITHOUT BREAKING STRIDE, he twirls and takes one of them out with a kick. The second throws one punch, two and hits AIR. Lee chops four times and the guy ends up in a hedge. Whitney, Geiger and Williams come around a corner. The agent lying on the patio points.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "PATIO AGENT",
        "line" : "He went up!",
        "followup" : "They look up at a WALL on the side of the house. Beyond it is the Consulate Compound."
      }, {
        "shot_id" : 1,
        "character" : "AGENT WHITNEY",
        "line" : "(into mike) Secure the area! ",
        "followup" : ""
      } ],
      "key_words" : [ "TWO AGENTS", "WALL", "AGENT WHITNEY", "AIR", "PATIO AGENT", "WITHOUT BREAKING STRIDE" ]
    } ]
  }, {
    "id" : 56,
    "transition" : "",
    "position" : "EXT.",
    "place" : "THE COMPOUND-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee is below the wall, in the bushes, silently making his way into the large back yard area. He hears someone coming. He hops up onto one of the Jacaranda Trees and starts climbing. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 57,
    "transition" : "",
    "position" : "INT.",
    "place" : "RESIDENCE",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The Agents run into the house, head for the doors. Whitney runs up the stairs. Other agents behind. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 58,
    "transition" : "",
    "position" : "INT.",
    "place" : "AMBASSADOR'S BEDROOM",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The Ambassador is pacing. Chi-Ying is sitting. She has been crying. The commotion outside finally reaches them. We HEAR MEN YELLING. The door bursts open. Whitney enters.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "I'm sorry, sir, we have an unauthorized entry. Please get away from the windows! ",
        "followup" : ""
      } ],
      "key_words" : [ "WHITNEY", "HEAR MEN YELLING", "I'" ]
    } ]
  }, {
    "id" : 59,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "THE ROOF-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee crawls along the steeply pitched roof looking for a way in. He gets to a GABLE with a WINDOW. But before he can look inside, an AGENT sticks his head out the window and looks around. The agent turns to his left. Nothing. He turns to his right and there's Lee, smiling at him. POW. Lee connects with a right and the agent ACCIDENTALLY FALLS out the window. Lee freaks and DIVES for the guy as he slides down the roof.",
      "sentences" : [ ],
      "key_words" : [ "AGENT", "GABLE", "POW", "ACCIDENTALLY FALLS", "WINDOW", "DIVES" ]
    }, {
      "id" : 1,
      "on" : "ON TWO AGENTS",
      "desc" : "They're walking in the back yard, guns drawn. Something makes one of them look up. AGENTS POV The guy from the window, still out cold, is dangling off the edge of the house.",
      "sentences" : [ ],
      "key_words" : [ "AGENTS POV" ]
    }, {
      "id" : 2,
      "on" : "ON LEE",
      "desc" : "He's out of sight, still on the roof, holding the guy's collar and keeping him from falling over the edge. He peaks down at the agents and then lets the guy go. He lands on the two agents like a bomb, knocking both of them down. Lee jumps off the roof and starts running across the huge lawn. Three agents come out of the POOL HOUSE and try to cut him off. Lee KICKS one of them into the pool. He faces off with the other two as more agents come across the yard. Lee swings and kicks his way around the pool. Two more AGENTS get into the fray. Lee pops one into the other and pushes both of them into the pool. Suddenly the odds are too great as more agents close in. Lee DIVES into the pool and swims under water to the other end. He comes up in time to PUNCH two of the guys he threw in. Then he jumps out of the pool. Six agents chase him back across the lawn. Lee runs up an outside staircase at the back of the house. He disappears in a door just as one of the agents FIRES. ",
      "sentences" : [ ],
      "key_words" : [ "PUNCH", "FIRES", "POOL HOUSE", "AGENTS", "KICKS", "DIVES" ]
    } ]
  }, {
    "id" : 60,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "THE AMBASSADORS BEDROOM",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We HEAR the shot ring out.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "Down stairs, sir! Now!",
        "followup" : "Whitney shoves the Ambassador and Chi-Ying out of the bedroom. Then he charges out onto a balcony, gun drawn. "
      } ],
      "key_words" : [ "WHITNEY", "HEAR" ]
    } ]
  }, {
    "id" : 61,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "AN UPSTAIRS HALLWAY",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee comes down the hall, dripping wet. He moves quickly and quietly. He passes a doorway and immediately RUSS comes out the door, behind Lee, quietly getting ready to pounce. Ahead of Lee, Whitney comes out of the bedroom gun drawn. Suddenly, Lee takes out Russ behind him with an elbow and does his quick hands routine with Whitney's pistol. Both Whitney and Russ end up on their backs. ",
      "sentences" : [ ],
      "key_words" : [ "RUSS" ]
    } ]
  }, {
    "id" : 62,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "THE FOYER-DAY",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Han and His wife are surrounded by agents in the large open foyer below the staircase. Suddenly, Lee drops down from the stairway above and lands right in front of Han. SIX FBI PISTOLS all point at Lee.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Lee?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Sorry I'm late, sir.",
        "followup" : "Lee bows, offers a smile of regret. Then he looks down at his feet where he's now dripping water. Russ and Lee appear on the landing above the foyer. Han looks up and sees them."
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Mr. Russ, I think there has been a misunderstanding. Both Russ and Lee are looking embarrassed.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I would like you to meet, Mr. Lee. Lee looks up and bows to them both. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Excuse me very much.",
        "followup" : "Agents slowly lower their guns. Lee holds up TWO REVOLVERS."
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "(to Russ and Whitney) Oh yes, your guns. Russ fumes.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Where the hell is -- ",
        "followup" : ""
      } ],
      "key_words" : [ "SIX FBI PISTOLS", "HAN", "TWO REVOLVERS", "RUSS", "LEE", "I'" ]
    } ]
  }, {
    "id" : 63,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CARTER'S SEDAN",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Pulling up to the Consulate Compound. Holding out his I.D. and passing FBI AGENT WILLIS.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "FBI AGENT WILLIS",
        "line" : "Good job, Detective. Real nice piece a work.",
        "followup" : "Carter gives him a look. No idea what he's talking' about. But he must have done something good."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "OK. Yeah. Thanks. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "FBI AGENT WILLIS", "OK" ]
    } ]
  }, {
    "id" : 64,
    "transition" : "",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE RESIDENCE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter enters, heads for the office when the door opens and Han and Lee come out. Carter stops, floored.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey! Lee smiles. Turns to the Ambassador.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "This is the agent I was telling you about. Mr. Carter. Han looks at Carter. But Carter just stares at Lee.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I'm sure Mr. Carter was only concerned with my best interests. He did not understand the importance of my getting here quickly.",
        "followup" : "Russ exits the office, staring at Carter. Carter realizes he's in some shit, unless he can do a little fast bullshitting. Carter suddenly smiles at Lee."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Sorry I'm late. Guess the directions were okay. Carter looks at Lee's wet clothes.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "I see you came via Malibu.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "(to Lee) Come on. Let's get you some dry clothes.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Carter, can I have a moment? Of course, sir. All the time you want.",
        "followup" : "Carter smiles at Lee as he moves past and enters the Lion's den. The door closes. "
      } ],
      "key_words" : [ "CARTER", "HAN", "RUSS", "LEE", "I'" ]
    } ]
  }, {
    "id" : 65,
    "transition" : "",
    "position" : "INT.",
    "place" : "HAN'S OFFICE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ faces off with Carter.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "What do you mean you lost him?! How could you lose him?!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Try a bus load of - no, make that two bus loads of Chinese -- The PHONE RINGS. Russ turns to the phone.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You want me to take care of this, you gotta use me.",
        "followup" : "Russ ignores him. Han enters, moving quickly to the desk."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You understand what I'm sayin'?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Carter, shut up!",
        "followup" : "Lee steps into the room. All attention on Han. Russ nods to him. Han answers. The ELECTRONIC SURVEILLANCE EQUIPMENT CLICKS INTO ACTION - recording, tracking. The phone conversation is in Mandarin."
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Hello.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG'S VOICE",
        "line" : "Ambassador Han.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Yes.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG'S VOICE",
        "line" : "Even if you deny the FBI is there, I will assume you are lying. Han looks at Russ. Russ hesitates, then nods.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "My daughter.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG'S VOICE",
        "line" : "She's fine.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Can I speak with her? Sang speaks on the phone, seated at an empty table .",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG",
        "line" : "Not yet.",
        "followup" : "Sang looks at his watch, in no hurry. "
      } ],
      "key_words" : [ "SANG", "CARTER", "RUSS", "ELECTRONIC SURVEILLANCE EQUIPMENT CLICKS INTO ACTION", "FBI", "SANG'S VOICE", "HAN", "PHONE RINGS", "I'" ]
    } ]
  }, {
    "id" : 66,
    "transition" : "",
    "position" : "INT.",
    "place" : "HAN'S OFFICE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Whitney is watching the clock. They need a few more moments to make the trace.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(whisper) Keep him talking. Phone conversation continues in Mandarin.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "How do I know she is alive?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG",
        "line" : "Have to take my word for it.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "What do you want?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG",
        "line" : "I want you to think for a moment... what is a daughter worth?",
        "followup" : "Whitney motions to keep talking. They're close. Very close to making the trace."
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Everything.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG",
        "line" : "Good. I'd hate to think less. Whitney signals. They've got the trace.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG",
        "line" : "But we've talked enough for now. I'll call later, after you've had a chance to think about... the mistakes you've made. The phone line goes dead. Whitney holds up the paper.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "620 South Main. Downtown.",
        "followup" : "Russ, Whitney and Agents immediately head for the door, past Lee and Carter. "
      } ],
      "key_words" : [ "SANG", "WHITNEY", "HAN", "RUSS", "I'" ]
    } ]
  }, {
    "id" : 67,
    "transition" : "",
    "position" : "EXT.",
    "place" : "CHINESE CONSULATE",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ, Whitney, other Agents exit, moving to cars. Lee hurries up ",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Mr. Russ -- Russ stops, turns to Lee.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Mr. Lee, Detective Carter has been assigned to help you. He is the very best at... (pause) ...what he does. Excuse me.",
        "followup" : "A car pulls up. Russ gets in. Car pulls away. Followed by others. Lee watches, anger building, but trying not to show it. Carter comes up behind him. Both of them watch the FBI cars peel out. Then they turn and look at each other. Not exactly a match made in heaven. "
      } ],
      "key_words" : [ "RUSS", "FBI", "LEE" ]
    } ]
  }, {
    "id" : 68,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "THREE UNMARKED FBI CARS pull out of the Consulate Compound. Move quickly down the street. Carter's sedan pulls out a few moments later. ",
      "sentences" : [ ],
      "key_words" : [ "THREE UNMARKED FBI CARS" ]
    } ]
  }, {
    "id" : 69,
    "transition" : "",
    "position" : "INT.",
    "place" : "SEDAN",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter behind the wheel. Lee next to him. Both are quiet for a moment, then --",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You're a regular god damn acrobat, aren't you? Bet you feel real good makin' me look like an asshole.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "It was not my intent --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Right....",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Mr. Carter, I appreciate your desire to show me a good time, but that is not the reason I am here.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Let me just clarify a few things. I don't care what kind of cop you are in China, you have no jurisdiction in America. Without me you are just another tourist. Carter and Lee exchange a look.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "So don't pull that shit again. they're following.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "What about them?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I know a shortcut.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Shortcut?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You don't know what a shortcut is? Lee shakes his head.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "(to himself) Lame ass country. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "LEE" ]
    } ]
  }, {
    "id" : 70,
    "transition" : "DISSOLVE TO:",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter is repeatedly hitting the speed dial on his CELL PHONE while he drives. We hear that HEE HAW sound you get when you're in cell phone hell.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(tossing the phone) Piece a shit.",
        "followup" : "Carter starts looking for a phone booth. Lee, meanwhile, picks up the cell phone and expertly RIPS it open. He starts studying the inner workings of the phone."
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Accessory board probably burnt out. Carter looks over at his phone and freaks.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey! What did you do to my phone, man!? You people can't keep your hands off electronics, can you?!",
        "followup" : ""
      } ],
      "key_words" : [ "CELL PHONE", "CARTER", "RIPS", "HEE HAW", "LEE" ]
    }, {
      "id" : 1,
      "on" : "ON THE SEDAN",
      "desc" : "He pulls across the street from a MINI-MART. We see EMPTY PHONE BOOTHS out front.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "CARTER (cont'd)",
        "line" : "Wait here.",
        "followup" : "Carter shuts the door. Starts away. Stops. Then returns to the car, reaches in and quickly snaps a hand cuff on Lee's arm and another on the steering wheel."
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "Always cuff a friend or a wife or a kid to the steering' wheel so nobody'll steal the car. It's like a human anti-theft device. (big smile) Be right back.",
        "followup" : "Carter crosses to the Mini Mart. Lee watches him, then looks at his wrist cuffed to the steering wheel. "
      } ],
      "key_words" : [ "CARTER", "MINI", "MART", "EMPTY PHONE BOOTHS" ]
    } ]
  }, {
    "id" : 71,
    "transition" : "",
    "position" : "EXT.",
    "place" : "MINI-MART",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter is HOLDING on the pay phone when a GUY IN A TURBAN comes out of the store.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Nice hat. (on the phone) Hey, Johnson! It's Carter. Listen, meet me at 620 S. Main. Some Federal type action is gonna be going down there. INTERCUT WITH JOHNSON She's at her desk.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Well.. I wouldn't want to be in the way.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No way in the way! I'm talkin' back up, Johnson. I'm in charge! And I need you, baby. ",
        "followup" : ""
      } ],
      "key_words" : [ "JOHNSON", "CARTER", "GUY IN", "TURBAN", "HOLDING", "INTERCUT WITH JOHNSON", "I'" ]
    } ]
  }, {
    "id" : 72,
    "transition" : "CUT TO:",
    "position" : "",
    "place" : "INT. THE SEDAN-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter comes back across the street and gets in the car. ",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "OK, now I'm gonna show you what a shortcut is...",
        "followup" : "Carter reaches down to start the car and finds that his steering wheel is gone. Along with Lee."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Sonuvabitch! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "OK", "I'" ]
    } ]
  }, {
    "id" : 73,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "STREET DOWNTOWN",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "UNMARKED CARS pulling up. FBI SPECIAL TACTICS TEAMS arriving and deploying. The target: the OLD OFFICE BUILDING across the street. A TEAM OF BLACK CLAD FBI moves into the ground floor. he's still attached to it. Whitney sees him first and does a double take.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "Jesus H... Lee moves toward Whitney.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY (cont'd)",
        "line" : "Where's Carter?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Lost I think. Which building? Russ walks up.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Mr. Lee, this is an FBI operation.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I was brought here to help.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Please stay back. Two AGENTS walk up ready to restrain him.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "She is very important to me. You must let me --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Mr. Lee, the very fact that you know her compromises your judgement. Whitney comes up behind Russ, interrupting --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "Area secured. Teams ready.",
        "followup" : "Another TAXI pulls up. Carter jumps out. Storming toward Lee."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "He stole my wheel! ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "This is pathetic.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'm gonna arrest the sonuvabitch! (turns to Lee) Your ass is goin' to jail! Carter WHISPERS to the two restraining agents:",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Hold me back. (yelling) After I kick it first!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(to OTHER AGENTS) Get them the hell out of here! (on the radio) You are cleared to go.",
        "followup" : ""
      } ],
      "key_words" : [ "WHITNEY", "CARTER", "RUSS", "TEAM OF BLACK CLAD FBI", "FBI", "OLD OFFICE BUILDING", "FBI SPECIAL TACTICS TEAMS", "OTHER AGENTS", "LEE", "UNMARKED CARS", "TAXI", "AGENTS", "I'", "WHISPERS" ]
    }, {
      "id" : 1,
      "on" : "ON THE BUILDING",
      "desc" : "We can see FLASHLIGHTS moving in the windows as the team moves to the top floor. ",
      "sentences" : [ ],
      "key_words" : [ "FLASHLIGHTS" ]
    } ]
  }, {
    "id" : 74,
    "transition" : "",
    "position" : "INT.",
    "place" : "OLD BUILDING",
    "time" : "OFFICE CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The DOOR is KICKED OPEN. AGENTS BURST INTO THE ROOM, Drop to positions, ready to fire. They move quickly through the office, checking every corner. But the office is empty. Except for the table, chair and phone.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEAD AGENT TACTICAL TEAM",
        "line" : "(into radio) Area secured. The room is empty. INTERCUT WITH RUSS ON THE STREET as he gets the message.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Dammit!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEAD AGENT TACTICAL TEAM",
        "line" : "A table, chair and phone.",
        "followup" : "THE PHONE RINGS. The Lead Agent turns to the phone. First ring, second ring."
      }, {
        "shot_id" : 0,
        "character" : "LEAD AGENT TACTICAL TEAM",
        "line" : "And it's ringing. (Third ring) What do you want me to do? Russ hesitates. Then starts running for the building.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "I'm on my way.",
        "followup" : "FOURTH RING. FIFTH RING. Finally he takes off his helmet, picks up the receiver. "
      } ],
      "key_words" : [ "LEAD AGENT TACTICAL TEAM", "RUSS", "FIFTH RING", "FOURTH RING", "DOOR", "THE PHONE RINGS", "INTERCUT WITH RUSS ON THE STREET", "KICKED OPEN", "AGENTS BURST INTO THE ROOM", "I'" ]
    } ]
  }, {
    "id" : 75,
    "transition" : "",
    "position" : "EXT.",
    "place" : "OLD BUILDING",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The TOP FLOOR OF THE BUILDING SUDDENLY BLOWS UP in a huge fireball. Russ and Agents are knocked down. Lee and Carter take cover from the debris. CLOUD OF DUST AND SMOKE roll over them. When Lee gets up, he's facing away from the building. He sees something. P.O.V. OF A MAN -- CONTINUOUS Standing in a doorway as the FLASH FROM THE EXPLOSION LIGHTS up his ",
      "sentences" : [ ],
      "key_words" : [ "OF", "TOP FLOOR OF THE BUILDING SUDDENLY BLOWS UP", "MAN", "CONTINUOUS", "FLASH FROM THE EXPLOSION LIGHTS", "CLOUD OF DUST AND SMOKE" ]
    } ]
  }, {
    "id" : 76,
    "transition" : "",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee is stunned. He gets up quickly, starts running after Sang who disappears down an alley into darkness. Carter sees Lee.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey! (to himself) Not this time...",
        "followup" : "Carter goes after him. "
      } ],
      "key_words" : [ "CARTER" ]
    } ]
  }, {
    "id" : 77,
    "transition" : "",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee runs after Sang into the alley. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 78,
    "transition" : "",
    "position" : "EXT.",
    "place" : "ALLEY INTERSECTION",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Sang is running hard when he turns and sees Lee. Sang jumps onto a DUMPSTER in the alley, grabs a FIRE ESCAPE LADDER and starts climbing. Lee leaps onto the dumpster, grabs the ladder and goes up. Sang climbs two stories, smashes a WINDOW and climbs into the building.",
      "sentences" : [ ],
      "key_words" : [ "FIRE ESCAPE LADDER", "DUMPSTER", "WINDOW" ]
    }, {
      "id" : 1,
      "on" : "ON CARTER",
      "desc" : "He rounds the corner and sees Lee going up the building.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "What are you doing, god damn it!?",
        "followup" : "Carter runs for the dumpster and the fire escape. "
      } ],
      "key_words" : [ "CARTER" ]
    } ]
  }, {
    "id" : 79,
    "transition" : "",
    "position" : "INT.",
    "place" : "BUILDING",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We're in an ABANDONED ATRIUM moving down an open, dirty hallway. Lee moves quickly and quietly. He peaks over the edge of the atrium: LEE'S POV Two floors below we see a TUNNEL filled with trash. Lee passes SCAFFOLDING that's been abandoned. He stops and listens. Suddenly, we hear SOMEONE RUNNING. Lee takes off.",
      "sentences" : [ ],
      "key_words" : [ "LEE'S POV", "TUNNEL", "SOMEONE RUNNING", "ABANDONED ATRIUM", "SCAFFOLDING" ]
    }, {
      "id" : 1,
      "on" : "ON CARTER",
      "desc" : "He climbs through the window and takes off down the open hallway.",
      "sentences" : [ ],
      "key_words" : [ ]
    }, {
      "id" : 2,
      "on" : "ON SANG",
      "desc" : "He explodes around a corner and runs over a BRIDGE connecting both sides of the atrium. A sign on the bridge says DANGER-UNDER CONSTRUCTION. The bridge CREAKS and moves. Sang STUMBLES and drops something. But Sang doesn't stop and he makes it over the bridge. Lee runs up right behind Sang but he slows when he sees the bridge and the sign. He starts over slowly and picks up WHAT SANG DROPPED. CLOSE ON A DETONATOR The bridge CREAKS Loudly. But Lee scampers across. Carter is right on his heels. He doesn't even see the sign and accelerates as he runs over the bridge. We hear a massive CRACK!",
      "sentences" : [ {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "Oh shiiiiit!",
        "followup" : "The bridge gives way and Carter drops like a brick. He falls two stories and hits the tunnel floor on top of a huge mass of debris. Dust swirls for a moment. Carter doesn't move and then:"
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "...ahhh.",
        "followup" : ""
      } ],
      "key_words" : [ "DANGER", "CARTER", "STUMBLES", "UNDER", "DETONATOR", "CREAKS", "BRIDGE", "CRACK", "CLOSE ON", "CONSTRUCTION", "WHAT SANG DROPPED" ]
    }, {
      "id" : 3,
      "on" : "ON LEE",
      "desc" : "He's across the atrium when he sees Carter fall. Lee grabs a PIPE and quickly swings himself down to the floor of the tunnel. He finds Carter covered in dust and debris.",
      "sentences" : [ {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "Am I dead?",
        "followup" : "Suddenly we HEAR SCREECHING TIRES. Both men turn. A CAR IS SCREAMING DOWN THE TUNNEL toward them. Lee looks around. No where to go. At the last instant, he grabs Carter and they roll out of the way. The car ROARS by and goes out the other end of the tunnel."
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "You make the plate?",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "LEE",
        "line" : "What plate?",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "The license! You get it?!",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "LEE",
        "line" : "No.",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "LEE Did you make the plate?!",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "It was my ass that almost got trashed!",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "LEE",
        "line" : "He was trying to kill me, not you.",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "Yeah, sure, you got lots a enemies in L.A. after what? Six hours?",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "LEE",
        "line" : "It was a man I was after in Hong Kong.",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "Bullshit! You were trying' to lose my ass again.",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "LEE AND CARTER",
        "line" : "I might have... (pause) It does not matter now. Lee starts walking down the tunnel.",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "Hey, wait a second! Lee keeps walking.",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "You tryin' to make this out to be my fault? Like it was me who got in the way of you?! You gotta not be serious. (nothing from Lee) That what you're thinking'?! Come on, say it if you think it. SAY IT! Lee stops, turns back.",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "LEE",
        "line" : "When a man steps in dung, it is obvious. There is no need to rub it in his face. The smell is the same.",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "CARTER",
        "line" : "What is that, some kind of Chinese proverb?",
        "followup" : ""
      }, {
        "shot_id" : 3,
        "character" : "LEE",
        "line" : "No. I just made it up. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "PIPE", "LEE AND CARTER", "ROARS", "DOWN THE TUNNEL", "LEE", "HEAR SCREECHING TIRES", "CAR IS SCREAMING", "SAY IT" ]
    } ]
  }, {
    "id" : 80,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "THE OLD BUILDING",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "building. Russ and Whitney stand grimly watching the carnage. JOHNSON walks up to them.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "(to Russ) Excuse me. I'm looking for Detective Carter...",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Who are you? Johnson pulls her badge.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "LAPD. Explosives Division. Russ suddenly gets angry.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Did Carter send for you?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Yes sir.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Explosives Division?! Well, you're too god damn late! Lee and Carter walk up. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yo, Johnson...",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(interrupting) You think this is funny, Carter? You send for someone from Explosives!? Four men just died in there!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, man, you can use her. She's an expert!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "That's what you were supposed to be! Johnson is starting to back away.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Look, I don't know what's goin' on here, but I'm history. She starts to walk back to her car.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No, wait!",
        "followup" : "He runs after Johnson and catches her as she gets into her car. Hey, I don't need that. You just got your last back-up from me. She squeals away from the scene. Carter looks beat up and defeated. We HEAR a PHONE START TO RING. Once, twice. Carter turns. A PAY PHONE is ringing next to a building. Three, four, five. Carter, annoyed, finally crosses to the booth, answers --"
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You're calling a phone booth, asshole.",
        "followup" : "Hangs up. He gets five steps away when it starts to RING AGAIN. He stops, turns back. Answers."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You know what a phone booth is?!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "The bomb was meant as a demonstration of our sincerity. If you want the Ambassador's daughter back alive, listen and do not talk.",
        "followup" : "Carter realizes now who he's got on the other end of the line. He covers the receiver."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Lee! It's him!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "The first drop will be made tomorrow. At twelve o'clock. The amount will be fifty million.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Fifty million! Are we talkin' United States dollars?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "In used currency. Nothing bigger than a fifty.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That's some serious poundage in dollars.",
        "followup" : "Carter covers the phone and tries to get the attention of the FBI."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, it's him. On the phone. (back to phone) Where do you think an Ambassador's gonna come up with that kinda cash? I mean, how much can a guy like that take home, after taxes? And in China. (covers phone again) Lee finally turns and hears him.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "(back to phone) I mean I don't think he even gets paid in dollars. They probably pay in yang or yin or...rice, whatever it is they got there. Lee walks over. Carter holds the phone so Lee can hear.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "What is your name?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That's cool. We're gettin' to know each other. This is a good thing. I'm Carter.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "Carter. I just want to be able to tell the Ambassador who was responsible for the death of his daughter because he talked too much.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, that's whacked! I thought we was gettin' on here!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "Shut up!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "OK. Say what it is.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "The Ambassador will receive instructions for the drop, half an hour before it is to be made. If it is successful, there will be more. Thank you, Agent Carter.",
        "followup" : "The phone goes dead. Carter exchanges a look with Lee. "
      } ],
      "key_words" : [ "RING AGAIN", "MAN'S VOICE", "CARTER", "RUSS", "PAY PHONE", "LAPD", "FBI", "HEAR", "OK", "JOHNSON", "I'", "PHONE START TO RING" ]
    } ]
  }, {
    "id" : 81,
    "transition" : "",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ is on his car phone --",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(into phone) -- as soon as we get a team in place...yes, sir. I'll make sure it happens. Russ hangs up as Carter approaches.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Fifty million --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "I don't think you need to be here!",
        "followup" : "Russ turns away. Whitney gives Carter a look, then follows."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That's what the man wants for the girl. Just called on the pay phone across the street. With the instructions for the first drop. Just thought you might be interested. It's what they call a ransom demand. Carter turns and starts walking away.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Carter! Carter turns slowly.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hmmmm?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Don't play bullshit games with me.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Eleven thirty tomorrow the Ambassador will receive a phone call telling him where the drop is. He said the bomb was a demonstration of their sincerity. Carter turns to go, then stops, turns back. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh yeah. The caller was a man. Confident. Had an accent. My guess, Asian. Anything else I can do for the FBI, sir?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Why don't you try the assignment. Or should I call and ask for somebody who can handle it?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No, sir. I'm as good as it gets.",
        "followup" : "Carter offers a smile, then starts back toward Lee. The smile disappears as he turns his back on Russ."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "(to himself) Prick. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "RUSS", "FBI", "I'" ]
    } ]
  }, {
    "id" : 82,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "CARTER'S APARTMENT",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We watch Carter and Lee get out of a cab in the Los Felis district. Over this we HEAR:",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER VO",
        "line" : "I thought you said you'd never been to America before. How the hell did you know where you were goin' if you never been here before? Huh?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE VO",
        "line" : "(pissed off) You had map in car. Chinese can read maps, too. Where will you take me now, Disneyland? ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER VO",
        "line" : "Hey, I was just doin' my job. (pause) We're goin' to my crib.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE VO",
        "line" : "Crib? What crib?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER VO",
        "line" : "My home, man, my home! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER VO", "LEE VO", "HEAR" ]
    } ]
  }, {
    "id" : 83,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CARTER'S APARTMENT-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter and Lee come through the door into a dark leather living room set up for one thing: pussy. Carter hits a series of switches. Subdued lights come on, a stereo starts with nasty rap, a gas fireplace pops on, and SOFT PORN starts playing on the VCR. Carter sees Lee's reaction to the setting.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I can't help it. I'm a hopeless romantic.",
        "followup" : "Carter disappears into a bedroom. Lee wanders over to a shelf with a collection of LOVE OILS. Carter sticks his head out of the bedroom as he slips on a clean shirt."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, don't drop that shit. It's imported. He goes back in the bedroom and talks from there.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER VO",
        "line" : "Look, none of this has gone down right. Too many big heads thinkin' they don't need nothin' from nobody. Forgettin' a man's daughter is gone. He comes back out buttoning up a clean pair of pants.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I know I been part of it so... I'm sorry. Lee looks at Carter for a beat.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I worked with Ambassador Han and his family for ten years. He wanted me to come with them to America. If I had, this might not have happened.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Don't go there...",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I could not come. I had other responsibilities.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, stop. We're just gonna wind up in some bar, drinking' to forget all the things we shoulda done and then you'll start singin' Beach Boy songs again. Then I'll really get depressed.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I also did not come because I think I would not fit in America. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, everybody fits in here. Look at L.A., man. Nobody's from here. My momma's from Detroit, my dad's from Atlanta, they met in Texas, got married in Vegas and I was born in Alabama. So where the hell am I from? Kenya? Carter looks at Lee and makes a decision.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Alright, listen, no bullshit just tell me straight: did you really know the guy you were chasin'?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Yes. He was part of the Juntao crime family. He may be Juntao himself. (reaches into pocket) And he dropped this.",
        "followup" : "Lee retrieves a small BLACK CYLINDER. Carter glances at it. Then recognizes the DETONATOR."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Looks like a clue to me, Detective Lee. Carter smiles at Lee. Lee slowly smiles back at Carter.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Let's go see a friend of mine. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "LOVE OILS", "VCR", "DETONATOR", "LEE", "SOFT PORN", "CARTER VO", "BLACK CYLINDER", "I'" ]
    } ]
  }, {
    "id" : 84,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "CARTER'S APARTMENT-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee and Carter come out a back door. Carter points below them on the street where a HUGE 1971 WHITE ELDORADO CONVERTIBLE sits gleaming under the street lights.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(proudly) The Carter ride. Lee takes in the car as they walk up to it.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "(in awe) This is bigger than my apartment in Hong Kong. They get in.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Welcome to the wide open spaces of America!",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "WHITE ELDORADO CONVERTIBLE", "HUGE", "LEE" ]
    }, {
      "id" : 1,
      "on" : "ON THE CADILLAC",
      "desc" : "It PURRS away from the curb and FLOATS down the road. ",
      "sentences" : [ ],
      "key_words" : [ "FLOATS", "PURRS" ]
    } ]
  }, {
    "id" : 85,
    "transition" : "DISSOLVE TO:",
    "position" : "EXT.",
    "place" : "POOL HALL-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The Caddy pulls up to a pool hall in a semi sleazy area.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "When we go inside, you let me handle everything, you hear? This is my man, you dig? My informant. You know what an informant is?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Stooly.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "What?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Stool pigeon.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah, somethin' like that. (talking very fast) OK, now this is a nasty ass place. When you go into a place like this, You got to maintain control. You following me? You lose it, you get hurt. Now, you're my responsibility and I don't want you hurt. You understand? OK, let's go.",
        "followup" : "Carter gets out of the car and walks away. Lee doesn't move. After a beat, Carter comes back."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "What?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "You talk too fast. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Come on! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "OK", "LEE" ]
    } ]
  }, {
    "id" : 86,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "POOL HALL-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The boys walk into a smoky hall patronized mostly by black people. Carter leads Lee past pool tables as they work their way to the very back of the room. Carter makes his presence known as he walks. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 87,
    "transition" : "",
    "position" : "",
    "place" : "He passes a guy taking a hit off a JOINT. He stops.",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "CARTER (to the guy) That better not be what I think it is. Gimme that. Carter swipes the joint out of the guy's hand. He takes a big hit. He holds it and tastes it for a beat. Lee is looking at Carter in disbelief.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Wait a minute. He takes ANOTHER HIT. Gives the joint back.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Don't leave town. I'm watching you.",
        "followup" : "Carter keeps moving. He walks by a luscious looking girl with tight stuff on."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "You see my ride, baby? You'd look good in that. Go outside. Take a look. He walks by a guy who gives him a dirty look.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "What are you lookin' at, dickhead? three more wait and four nasty looking BITCHES watch the action.",
        "followup" : "One of the players looks nervous when he sees Carter. This is OSCAR."
      }, {
        "shot_id" : 0,
        "character" : "OSCAR",
        "line" : "What's up, man?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Let's take a walk, Oscar. You got something a mine. (to Lee) Stay here.",
        "followup" : "Carter takes Oscar's arm and starts moving him out the side door. Two BIG BLACK DUDES in the foursome start to move to Oscar's aid. But he holds up his hands."
      }, {
        "shot_id" : 0,
        "character" : "OSCAR",
        "line" : "It's cool.",
        "followup" : "Oscar and Carter go out the back door. Lee sits down against the wall. One of the nasty bitches watching the game is ASIAN. She gives Lee a little smile. He smiles back. One of the BIG BLACK DUDES notices. "
      } ],
      "key_words" : [ "CARTER", "BIG BLACK DUDES", "BITCHES", "OSCAR", "ANOTHER HIT", "I'", "ASIAN" ]
    } ]
  }, {
    "id" : 88,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "AN ALLEY-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter and Oscar are arguing.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "OSCAR",
        "line" : "...never, never come here! I told you that, god damn it! And who the hell is that little gook you brought with you! ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Shut up, Oscar! I don't take shit from you! I give out the shit. That is the basis of our relationship. I give you shit and you take it! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "OSCAR" ]
    } ]
  }, {
    "id" : 89,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "THE POOL HALL-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "We're on the POV of one of the BIG BLACK DUDES who is lining up a shot. RACK FOCUS to Lee's face who is in perfect line for the shot.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "BIG DUDE",
        "line" : "(still lining up) What are you smiling at, rice bowl?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Who, me?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "BIG DUDE",
        "line" : "You making slant eyes at my girl friend? himself and forces a frown.",
        "followup" : "WHACK! Big dude hits the object ball so hard, it hops the table and heads right for Lee's head. Lee catches it like a baseball line drive, right in front of his nose. Nobody moves for a beat, mainly because everyone is impressed with Lee's catch."
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "My friend does not want me to get hurt.",
        "followup" : "Big Dude WHIPS the cue stick like a bat at Lee's head. Lee ducks and it SHATTERS against his chair. BIG DUDE #2 lunges for Lee who BOPS him with the pool ball he caught. And they're off! Two other guys jump on Lee and start pounding the shit out of em. Lee flips one onto the table and elbows the other. The two Big Dudes grab fresh cues. "
      } ],
      "key_words" : [ "BIG BLACK DUDES", "RACK FOCUS", "BIG DUDE", "LEE", "SHATTERS", "BOPS", "WHIPS", "WHACK", "POV" ]
    } ]
  }, {
    "id" : 90,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "AN ALLEY-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Oscar is turning the detonator over in his hand.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "OSCAR",
        "line" : "I ain't the man to be telling you about this.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Then who is?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "OSCAR",
        "line" : "Shit, you already busted his ass. Lafontaine. The dude who blew up the diner. He's your leverage. (holding up the detonator) He knows where this shit come from. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "OSCAR" ]
    } ]
  }, {
    "id" : 91,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "THE POOL HALL-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "WHAM! Lee is thrown against the back wall. The nasty girls all run past him and retreat to the ladies room. Lee grabs a cue and comes out swinging. He backs three guys away and then stops. BIG DUDE #1 is swinging his own cue. Lee paries like a fencer. He puts one hand behind his back and continues to parry and thrust. Finally, he pokes Big Dude in the forehead with his tip leaving a blue chalk spot. Then he turns the cue around and belts the guy on the spot. Lee turns and BREAKS his cue over two guys simultaneously, ducks a cue shot to his own head, and kicks one guy over a table and drops another with a flurry of hands. emptied. The guys he fought are all knocked out and UNDER tables. Carter comes in the back door.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(to Lee) Let's go. (he looks around) Everybody take off?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Took off. Yes. They took off. Lee catches up with Carter.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You see what I'm sayin'? You control the space.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Thank you. I learn a great deal.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "It happens.",
        "followup" : "Carter spots one of the fighters ON THE FLOOR as they walk out. It's the same guy who was smoking the joint. The guy moans as they go past."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "(to the doper/fighter) Hey, lightweight, I told you to lay off that shit. (over his shoulder) Get an education! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "ON THE FLOOR", "UNDER", "BIG DUDE", "LEE", "WHAM", "BREAKS", "I'" ]
    } ]
  }, {
    "id" : 92,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "COUNTY JAIL",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "ESTABLISHING the PRISON. The Cadillac SCREECHES to a stop. ",
      "sentences" : [ ],
      "key_words" : [ "PRISON", "SCREECHES", "ESTABLISHING" ]
    } ]
  }, {
    "id" : 93,
    "transition" : "",
    "position" : "INT.",
    "place" : "COUNTY JAIL",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter is talking to the OFFICER (BOBBY) behind the GLASS BOOTH.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "OFFICER",
        "line" : "It's eleven o'clock at night, Carter! They're all locked down, lights out.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah, but they're criminals, Bobby. Who gives a shit if they lose some sleep? Come on: wake his ass up.",
        "followup" : "BOBBY shakes his head but he picks up the phone. "
      } ],
      "key_words" : [ "CARTER", "GLASS BOOTH", "OFFICER", "BOBBY" ]
    } ]
  }, {
    "id" : 94,
    "transition" : "",
    "position" : "INT.",
    "place" : "JAIL INTERVIEW ROOM",
    "time" : "LATER",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee and Carter are waiting. Door opens. Bobby leads Lafontaine into the room. Lafontaine is pissed off, especially when he sees Carter.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "I got nothing to say to you. Carter motions for the guard to exit.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Give us five minutes, Bobby. The guard departs.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Sit down.",
        "followup" : "Lafontaine sits. Carter puts the detonator on the table. Pushes it across to him. Lafontaine picks it up, looks at Carter with a sick smile and PRESSES THE BUTTON."
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "Boom.",
        "followup" : "Lafontaine shoves the detonator back at Carter. Carter picks it up with a HANDKERCHIEF."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You got a boy friend in here yet? Cause you're gonna need somebody to kiss your ass goodbye.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "What are you talking about?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You're movin' to death row. See, your fingerprints are now on the murder weapon of Four FBI Agents. And when I turn this into the lab, they're gonna find Lafontaine all over it. And we already know... (holding up detonator) ...this is your MO.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "How did I do this?! Maybe you didn't notice but I'm in jail!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "All I gotta do is implicate. The Feds can do a lot with a good implication. Even if you don't get Sparky, I'll bet you get ten to twenty more. Plenty of time to find a nice fella. Lafontaine looks at Carter and Lee for a moment, then --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "You sonuvabitch.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'm waitin' here for a name.",
        "followup" : "Lee following."
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "I've never seen him. Carter ignores him. Starts to knock for the Guard.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "Juntao. Carter and Lee exchange glances.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Where do we find him?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE",
        "line" : "You don't. He finds you. Through his people. Carter and Lee wait for more.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LAFONTAINE (cont'd)",
        "line" : "(quietly) Fang Shan. A restaurant. China Town. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "LAFONTAINE", "HANDKERCHIEF", "FBI", "MO", "PRESSES THE BUTTON", "I'" ]
    } ]
  }, {
    "id" : 95,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "CHINESE CONSULATE COMPOUND",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The FBI cars are parked in front. Lights burning in Han's office. ARMED GUARDS now in front. ",
      "sentences" : [ ],
      "key_words" : [ "ARMED GUARDS", "FBI" ]
    } ]
  }, {
    "id" : 96,
    "transition" : "",
    "position" : "INT.",
    "place" : "HAN'S OFFICE",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Han has just received the news from Russ. The mood in the room is grim.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I am so sorry about your men.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Yes sir, me too. The State Department has authorized release of the funds. We'll have to make the first drop at 7. As soon as they pick up the money, we've got em. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "And Mr. Lee? Where is he?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Don't worry, he's with Carter. ",
        "followup" : ""
      } ],
      "key_words" : [ "HAN", "RUSS" ]
    } ]
  }, {
    "id" : 97,
    "transition" : "",
    "position" : "",
    "place" : "EXT. CARTER'S CAR(MOVING)-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee is explaining as Carter drives. ",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Juntao was one of the worst crime bosses in Hong Kong. When China regained control, he was forced out. Carter flips his cell phone open.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Let's get us a photo and description. We'll have an APB out while we stake out the restaurant. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "That is a problem. There is no description of Juntao. No known photograph.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Are you tellin' me nobody knows what he looks like? Come on, there must be witnesses somewhere.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Juntao's standing orders were to kill everyone. There were never witnesses. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "APB", "LEE" ]
    } ]
  }, {
    "id" : 98,
    "transition" : "DISSOLVE TO:",
    "position" : "EXT.",
    "place" : "CHINA TOWN",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The architecture. The signs. It's a different world. The Cadillac cruises down the street. It's late. Most things are closed. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 99,
    "transition" : "",
    "position" : "EXT.",
    "place" : "CHINATOWN",
    "time" : "LATER",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The Cadillac is parked on the side street. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 100,
    "transition" : "",
    "position" : "INT.",
    "place" : "CAR",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter and Lee are watching Fang Shan restaurant, eating from cartons of Chinese food.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "You like it?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah, it's good.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "That one is my favorite. Chicken puff with shark fin. Carter starts chewing a little slower.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "And the Eel is very good, too. But I have had better Camel's Hump. Carter has trouble swallowing. Puts down his food.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "You want more?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "hump, you know, gives me gas. (belches) scuse me. Silence for a moment, then Lee motions to the radio.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Music? A beat, then Carter nods. Lee reaches for the radio.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No! This time I pick.",
        "followup" : "Carter turns on the radio. Dials around until he finds WAR."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Now, that's American music.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Yes, I know this song.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You know War?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Who does not know War? (starts) War, hhh, Wo-ooh-wo-ooh-wo-oh. What is it good for? Absolutely nothing. Good-God, you all. Carter just stares at Lee for a moment in disbelief.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That's not how it goes.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Yes, I think so.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No, no. It's not good-God you all! It's Good-God, ya'll. Ya'll!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Yee-aww. Carter turns off the radio.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Not yee-aw, Ya'll. And it's gotta be angry. Like you're pissed off.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Good God, ya'll!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No! You hate me. Look, I'm gonna do it one time. That's it.",
        "followup" : "Carter gets out of the car. Lee follows. Carter limbers up for a moment, then starts a dance move to get him into the beat."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "War! huuuuhh! wo-ooh-wo-ooh-wo-oh! what's it good for? absolutely nuthin' good-gawd ya'll!",
        "followup" : "Lee gives it his best shot, trying to mimic Carter's dance move. But it's more martial arts than dance."
      }, {
        "shot_id" : 0,
        "character" : "LEE AND CARTER",
        "line" : "War! huuuuhh! wo-ooh-wo-ooh-wo-oh! what's it good for? absolutely nuthin' good-gawd ya'll",
        "followup" : "Lee tries to get into the rhythm with Carter, undulating his body to Carter's motion. But Carter watches Lee's martial arts interpretation and he starts to alter his moves to Lee."
      }, {
        "shot_id" : 0,
        "character" : "LEE AND CARTER",
        "line" : "War! huuuuhh! wo-ooh-wo-ooh-wo-oh! what's it good for? absolutely nuthin' good-gawd ya'll!",
        "followup" : "Both of them are moving side by side, in step as they sing. Totally involved. Rocking out."
      }, {
        "shot_id" : 0,
        "character" : "LEE AND CARTER",
        "line" : "War! huuuuhh! wo-ooh-wo-ooh-wo-oh! what's it good for? absolutely nuthin' good-gawd ya'll!",
        "followup" : "They both turn and face each other. As they dance, Lee BEGINS TO TEACH CARTER his quick move for taking someone's gun away. "
      } ],
      "key_words" : [ "CARTER", "WAR", "BEGINS TO TEACH", "LEE AND CARTER", "LEE", "I'" ]
    } ]
  }, {
    "id" : 101,
    "transition" : "",
    "position" : "EXT.",
    "place" : "LONG SHOT",
    "time" : "STREET CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A FEW NIGHT PEOPLE have stopped to listen. Staring at the Cadillac parked on the street. With Carter singing at the top of his lungs and Lee teaching him the quick moves to the music.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "War! huuuuhh! wo-ooh-wo-ooh-wo-oh! what's it good for? absolutely nuthin' good-gawd ya'll! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "FEW NIGHT PEOPLE" ]
    } ]
  }, {
    "id" : 102,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "FANG SHAN RESTAURANT",
    "time" : "NIGHT TO MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "SAME SHOT FADES to the next morning. ",
      "sentences" : [ ],
      "key_words" : [ "SAME SHOT FADES" ]
    } ]
  }, {
    "id" : 103,
    "transition" : "",
    "position" : "INT.",
    "place" : "CADILLAC",
    "time" : "CHINA TOWN MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee and Carter are asleep in the car. Carter's head is slumped against the window. A BUS ROARS past. They wake up. Carter groans.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "CARTER I got to stop that dancing in the street till all hours.",
        "followup" : "Carter stretches as Lee hops out HUMMING WAR, and opens the door for Carter. "
      } ],
      "key_words" : [ "HUMMING WAR", "CARTER", "BUS ROARS", "LEE" ]
    } ]
  }, {
    "id" : 104,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "FIRST BANK OF HONG KONG",
    "time" : "MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "THREE CARS pull up in front of the bank. Ambassador Han gets out of one. Followed by Russ, Whitney, and others. Security is high. ",
      "sentences" : [ ],
      "key_words" : [ "THREE CARS" ]
    } ]
  }, {
    "id" : 105,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CHINESE RESTAURANT",
    "time" : "MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter and Lee are at a table. Carter is having coffee. Lee is eating breakfast - rice and fish - with chopsticks. All the patrons are Asian. Carter is staring at Lee's food. Lee notices.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Want some?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No, fish is a PM food.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Excuse me?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Nobody in America eats fish in the AM. We're talking strictly an after twelve noon food type.",
        "followup" : "Lee turns and looks out the window. LEE'S P.O.V. He sees Sang entering the Fang Shan restaurant. BACK AT THE TABLE Lee stands suddenly."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "What?!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "It's him.",
        "followup" : "Carter looks out the window. But the street is already full of ASIAN PEOPLE."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Which one?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Carter throws some money onto the table. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "BACK AT THE TABLE", "AM", "LEE", "LEE'S", "PEOPLE", "PM", "ASIAN" ]
    } ]
  }, {
    "id" : 106,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter and Lee exit the restaurant, moving down the street.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "This is my territory now. You are my responsibility.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(pointing down) This concrete? This is still America.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "What do you hear?",
        "followup" : "They listen. CHINESE MUSIC filters out from one of the shops. SEVERAL CONVERSATIONS are in Chinese. There is nothing that would suggest this is America."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Walk two more blocks and neither of us will understand the language. Look, we can't take a chance on him recognizing you. Especially if he's Juntao. I'll go in, you back me up. That's the way it's gonna be. ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "CHINESE MUSIC", "CONVERSATIONS", "SEVERAL", "LEE", "I'" ]
    } ]
  }, {
    "id" : 107,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "FIRST BANK OF HONG KONG",
    "time" : "MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "In a private room, TEN MILLION DOLLARS is running though a money counting machine. Ambassador Han watches with Russ, Whitney and SEVERAL ASIAN BANK OFFICIALS. ",
      "sentences" : [ ],
      "key_words" : [ "TEN MILLION DOLLARS", "SEVERAL ASIAN BANK OFFICIALS" ]
    } ]
  }, {
    "id" : 108,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "FANG SHAN RESTAURANT",
    "time" : "BACK ALLEY MORNING",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The Asian man who drove the van (Chung) lifts the top of a DUMPSTER, throws a BLACK GARBAGE BAG inside. FROM UNDERNEATH THE DUMPSTER A sewer grate is REMOVED. Shu, one of the other men involved in the kidnapping, reaches up, opens a hidden door in the bottom of the Dumpster and pulls out the black trash bag. He drops down into the sewer. The sewer grate comes down on top as if nothing is out of place. ",
      "sentences" : [ ],
      "key_words" : [ "FROM UNDERNEATH THE DUMPSTER", "DUMPSTER", "BLACK GARBAGE BAG", "REMOVED" ]
    } ]
  }, {
    "id" : 109,
    "transition" : "",
    "position" : "INT.",
    "place" : "FANG SHAN RESTAURANT",
    "time" : "BASEMENT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A trap door opens and Shu crawls into the room. SEVERAL ASIAN MEN are waiting for him. Among them, Sang. Shu holds up the black garbage bag. Sang nods. ",
      "sentences" : [ ],
      "key_words" : [ "SEVERAL ASIAN MEN" ]
    } ]
  }, {
    "id" : 110,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "FANG SHAN RESTAURANT",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Open for business. Lee and Carter cross the street.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "OK, when you go in, just act like you're from outa town.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I am from outa town.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No, like a tourist. You know, things to see, money to burn, interested in stupid shit.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Ah. Like this. Lee looks around a lot and smiles.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yeah, yeah, good. You're havin' fun. Lookin' for a good time. You know, watch the women, look at their legs and shit. Like that's all you can think about. Gettin' some. Like her.",
        "followup" : "Carter motions at AN ATTRACTIVE ASIAN WOMAN moving toward them. Lee watches her walk past. He smiles politely. Carter watches him for a beat, then --"
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That ain't gonna get it. Watch this.",
        "followup" : "Carter screws up his face as if he's really enjoying watching the woman - like she's the best thing he's ever seen. A complete politically incorrect slob of a man. The only thing missing is the drool."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Like that.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I am sorry, but I have too much respect for women.",
        "followup" : "Carter stares at him blankly, then puts an arm around him."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "This is nothin' personal with women. We are undercover. It's okay to be a player when you're undercover. Okay? Lee hesitates, then nods. Carter takes out his i.d.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You've got no jurisdiction here so I'm some shit, you're L.A.P.D.",
        "followup" : "Carter opens his i.d. - Carter is black, Lee is Asian - that's one difference."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hold it like this, flip it open, flip it closed. It's the attitude that says who you are, not the i.d.",
        "followup" : "Carter flips the i.d. with authority, partially covering his photo with his hand. We hardly even see the photo. Carter hands the i.d. back to Lee."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You got to make people think this is you. (re: Carter's photo) You gotta believe that face is your face. Lee tries the flip.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "More wrist. It's gotta snap. Can't be limp. You do limp, they look at the photo, we're dead.",
        "followup" : "Carter points to his face. Lee tries the flip with more wrist. Snapping it open."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Good. Gimme a couple minutes, then come in. And take this. Carter slips Lee his gun.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "No, please, I don't --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "It ain't your ass, it's my ass you're backin' up. Take the damn gun.",
        "followup" : "Lee hesitates, then takes the gun and puts it into his pocket. "
      } ],
      "key_words" : [ "CARTER", "AN ATTRACTIVE ASIAN WOMAN", "LEE", "OK", "I'" ]
    } ]
  }, {
    "id" : 111,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "FANG SHAN RESTAURANT",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter enters the restaurant. Moves to the HOSTESS, a pretty young Chinese woman.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "HOSTESS",
        "line" : "For one?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No. Two. Tell Juntao I'll buy him some eel and shark fin for lunch. I'm sorry, sir, but I don't know -- Carter puts on his best Johnny Cochran.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Tell Mister Juntao Johnny Cochran's little brother...Joey is here. Joey Cochran. I am the legal advisor of record for Mister Henry Lafontaine. I need to discuss some legal ramifications with him. Carter takes the menu from her.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'll seat myself. I like that dress you're wearin'. Silk, right?",
        "followup" : "Carter smiles, moves to a table. Leaving the Hostess staring at him. "
      } ],
      "key_words" : [ "CARTER", "HOSTESS", "I'" ]
    } ]
  }, {
    "id" : 112,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "HAN'S OFFICE",
    "time" : "CHINESE CONSULATE CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "An open suitcase is filled with stacks of U.S. CURRENCY. The suitcase is shut. Han is in the room with Russ, Whitney, and other agents. It's almost eleven thirty. Whitney is explaining an electronic device to Han.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "... one will be inserted into the suitcase, the other will be on you. After you make the drop -- The phone rings. Han picks up.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Yes.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "You have what I asked for?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I do.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "Pack it into black garbage bags. Throw the bags into a garbage dump in the alley behind the Fang Shan Restaurant in China Town. You have twenty-nine minutes left. The phone clicks dead. Russ stands.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Let's go. ",
        "followup" : ""
      } ],
      "key_words" : [ "CURRENCY", "MAN'S VOICE", "WHITNEY", "HAN", "RUSS" ]
    } ]
  }, {
    "id" : 113,
    "transition" : "CUT TO:",
    "position" : "",
    "place" : "A MAN",
    "time" : "INT. OFFICE FANG SHAN RESTAURANT CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "hangs up the phone. Back to us. A DOZEN MEN in the room, among them Sang and Chung. A knock. Sang opens the door. It's the HOSTESS. She whispers something to Sang. He then crosses to ANOTHER MAN at a desk.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "SANG",
        "line" : "Someone has asked for Juntao.",
        "followup" : "The man turns now and we see it is Griffin. "
      } ],
      "key_words" : [ "SANG", "HOSTESS", "ANOTHER MAN", "DOZEN MEN" ]
    } ]
  }, {
    "id" : 114,
    "transition" : "CUT TO:",
    "position" : "",
    "place" : "FBI",
    "time" : "SHOTS CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "moving into action. SPECIAL TACTICS TEAM loading up. Cars pulling out of the Chinese Consulate Compound. The AMBASSADOR'S JAGUAR leads the way. Russ in the seat next to him. Whitney in the back. ",
      "sentences" : [ ],
      "key_words" : [ "SPECIAL TACTICS TEAM", "AMBASSADOR'S JAGUAR" ]
    } ]
  }, {
    "id" : 115,
    "transition" : "CUT TO:",
    "position" : "",
    "place" : "VIDEO MONITORS",
    "time" : "INT. FANG SHAN OFFICE DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Six video monitors keep tabs on the restaurant. On one monitor, Carter is sitting at his table, studying a menu. He orders something from an ATTRACTIVE ASIAN WAITRESS. She moves away and Carter's eyes follow her figure. Griffin and Sang watch him.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "SANG",
        "line" : "Maybe I have seen him. I'm not sure.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Bring him up.",
        "followup" : "Sang heads for the door when ANOTHER MONITOR catches Griffin's attention. The MONITOR reveals the Hostess seating a MAN at a table. It's Lee."
      }, {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Wait!",
        "followup" : "Sang turns at the door. Griffin is staring at the screen."
      }, {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Get the girl. ",
        "followup" : ""
      } ],
      "key_words" : [ "ANOTHER MONITOR", "SANG", "MONITOR", "ATTRACTIVE ASIAN WAITRESS", "MAN", "I'", "GRIFFIN" ]
    } ]
  }, {
    "id" : 116,
    "transition" : "",
    "position" : "EXT.",
    "place" : "FANG SHAN RESTAURANT",
    "time" : "BACK ALLEY DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "PANEL VAN waiting. Back doors are open. Shu exits the restaurant, large sack (Soon Young inside) over his shoulder. He puts the sack into the Van. ",
      "sentences" : [ ],
      "key_words" : [ "PANEL VAN" ]
    } ]
  }, {
    "id" : 117,
    "transition" : "",
    "position" : "INT.",
    "place" : "FANG SHAN RESTAURANT",
    "time" : "MENS ROOM CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter is at the urinal when he HEARS the VAN DOORS CLOSE from a partially open window. Then SOMEONE SPEAKING IN MANDARIN. Sounds urgent. He moves to the window, climbs up onto the sink. CARTER'S POV He can see SHU talking with the DRIVER OF THE VAN, Chung. Then another man exits the restaurant and we just get a glimpse of him before he gets into the van. It's Griffin. The only non-Asian Carter has seen in awhile. And the only British accent he's heard.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Make sure they do not leave.",
        "followup" : "Griffin pulls the van door shut and the Van moves quickly down the alley. CALIFORNIA LICENSE - LIK. "
      } ],
      "key_words" : [ "DRIVER OF THE VAN", "SHU", "VAN DOORS CLOSE", "CALIFORNIA LICENSE", "HEARS", "CARTER'S POV", "SOMEONE SPEAKING IN MANDARIN", "GRIFFIN", "LIK" ]
    } ]
  }, {
    "id" : 118,
    "transition" : "",
    "position" : "",
    "place" : "CARTER",
    "time" : "INT. MENS ROOM CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "He notes the LIK, until the bathroom door opens behind him. ANOTHER MAN enters, giving Carter a look as he's still on the sink, looking out the window. Carter takes a deep breath.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Ooo, man, what died! Whew! That wasn't me! Your own don't do that to you. AIR! Jesus....!",
        "followup" : "Carter exits. Man gives him a look. "
      } ],
      "key_words" : [ "CARTER", "AIR", "MAN", "ANOTHER", "LIK" ]
    } ]
  }, {
    "id" : 119,
    "transition" : "",
    "position" : "INT.",
    "place" : "KITCHEN",
    "time" : "FANG SHAN RESTAURANT CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The attractive waitress pours a white powder into a pot of tea. She puts the pot onto her tray with a cup. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 120,
    "transition" : "",
    "position" : "INT.",
    "place" : "FANG SHAN RESTAURANT",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The restaurant is now full of PEOPLE eating lunch and ordering. Carter waits at the table. Sees Sang with two men behind him crossing toward him. Lee is sitting across the room. Half hidden behind a menu. He watches Sang approach Carter. The waitress delivers the tea to Lee. He smiles politely.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "ATTRACTIVE WAITRESS",
        "line" : "(in Mandarin) Have you decided yet?",
        "followup" : "Lee, not wanting to take the menu down, shakes his head. The waitress departs. Lee's attention goes back to Carter. But he takes a sip of the tea. Sang stops at Carter's table."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Are you Juntao? Sang eyes him.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "We have to talk. Or my client? He's gonna talk and save himself. Upstairs.",
        "followup" : "Carter goes with Sang and the two men following. Lee waits until they are in the hallway, then he gets up and goes after them. "
      } ],
      "key_words" : [ "CARTER", "PEOPLE", "ATTRACTIVE WAITRESS" ]
    } ]
  }, {
    "id" : 121,
    "transition" : "",
    "position" : "INT.",
    "place" : "HALLWAY",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee sees the men take Carter up the stairway. TWO WAITERS come out of the kitchen. Lee enters the MENS ROOM. ",
      "sentences" : [ ],
      "key_words" : [ "TWO WAITERS", "MENS ROOM" ]
    } ]
  }, {
    "id" : 122,
    "transition" : "",
    "position" : "INT.",
    "place" : "MENS ROOM",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Empty except for Lee. Lee waits, giving the waiters time to pass. Then reopens the door. Stairway clear. Lee moves quickly up the stairs. But stops partway up. Has to steady himself just for a second. He's definitely light headed. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 123,
    "transition" : "",
    "position" : "INT.",
    "place" : "OFFICE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Door opens. Sang enters, followed by Carter and two men.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Alright, if the shoe don't fit, you can't convict, you know what I'm sayin' here?",
        "followup" : "WHACK! Sang spins and throws a FOOT into Carter's face. He slams to the floor."
      }, {
        "shot_id" : 0,
        "character" : "SANG",
        "line" : "(in Mandarin) Search him.",
        "followup" : "The two men pick up a dazed Carter and Shu starts searching him. "
      } ],
      "key_words" : [ "SANG", "CARTER", "WHACK", "I'", "FOOT" ]
    } ]
  }, {
    "id" : 124,
    "transition" : "CUT TO:",
    "position" : "",
    "place" : "FBI",
    "time" : "SHOTS CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Converging on Chinatown. Russ looks at his watch. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 125,
    "transition" : "CUT BACK TO:",
    "position" : "INT.",
    "place" : "SECOND FLOOR HALLWAY",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee moves up the stairs to the SECOND FLOOR. The door to the office is partially open. He sees CARTER GET SHOVED AGAINST a wall. Someone is coming out of the office. Lee quickly goes back down the stairs. Almost hits another waiter as he goes back into the MENS ROOM. ",
      "sentences" : [ ],
      "key_words" : [ "SECOND FLOOR", "CARTER GET SHOVED AGAINST", "MENS ROOM" ]
    } ]
  }, {
    "id" : 126,
    "transition" : "",
    "position" : "INT.",
    "place" : "MENS ROOM",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee waits. Thinks. He opens the door, sees another waiter moving past.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Excuse me. ",
        "followup" : ""
      } ],
      "key_words" : [ "LEE" ]
    } ]
  }, {
    "id" : 127,
    "transition" : "",
    "position" : "INT.",
    "place" : "STAIRWAY",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A waiter moves up the stairs, tray of food held high. Not until he gets to the SECOND FLOOR and looks up from the tray do we see it's Lee. He moves to the office. Stops again. Bit of dizziness. But he's okay in a second. ",
      "sentences" : [ ],
      "key_words" : [ "SECOND FLOOR" ]
    } ]
  }, {
    "id" : 128,
    "transition" : "",
    "position" : "INT.",
    "place" : "OFFICE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter is shoved back against the wall again.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, I'm a lawyer! You can't do this to a lawyer. You get in some deep shit for this kinda treatment.",
        "followup" : "Carter watches as the men go through his wallet. Sang looks at his watch. Says something in Chinese to the men. Two of them move to Carter. They pick him up. Drag him to the door. A knock. Everyone stops. One of the men opens it. Tray of food. Sang turns away. Lee enters, glances at Carter. And Carter suddenly pulls his arms away from the men."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'm tellin' you, when I sue, I win!",
        "followup" : "Carter's outburst draws Sang's attention. And Lee takes advantage - swinging the tray of food at him. The metal tray smashes into Sang's head, food flying. The men charge Lee. Lee swings the tray, smacking the first two in the heads, blocking a punch from a third, then flinging it like a frisbee at Shu, catching him in the forehead."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "(shocked) Damn, you're good!",
        "followup" : "Carter gets immediately decked by two guys who run into the room."
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "L.A.P.D. Nobody move!",
        "followup" : "Lee snaps open Carter's i.d. with so much attitude that it flies out of his hand, across the room. Hitting one of the men in the face."
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Oh no...",
        "followup" : "Carter gets up and turns on his two. Punching one in the gut, hitting the other in the chin."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Use the gun! USE THE GUN!",
        "followup" : "Carter gets hit, goes down again. Lee pulls the gun just as one of the men hits him. The GUN is knocked from his hand, breaks THROUGH THE "
      } ],
      "key_words" : [ "GUN", "CARTER", "USE THE GUN", "LEE", "THROUGH THE", "I'" ]
    } ]
  }, {
    "id" : 129,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "CHINATOWN CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The Ambassador's Jaguar pulls to the curb. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 130,
    "transition" : "",
    "position" : "INT.",
    "place" : "AMBASSADOR'S JAGUAR",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ checks his watch. Then picks up a radio.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(into radio) This is Agent Russ. We have five minutes. Take your positions.",
        "followup" : "FBI CARS move past. "
      } ],
      "key_words" : [ "FBI CARS", "RUSS" ]
    } ]
  }, {
    "id" : 131,
    "transition" : "CUT TO:",
    "position" : "",
    "place" : "LEE AND CARTER",
    "time" : "INT. OFFICE CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Each hitting an opponent - Lee a jab and elbow - Carter throws one to the gut, one to the jaw. Two different styles. Then they both get hit. And both slam back into the wall next to each other. Exchanging a quick look --",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Where's my gun!",
        "followup" : "Before Lee can answer, Sang wakes up and pulls a gun. Lee dives, rolls, comes up kicking. Hitting Sang's hand as he FIRES, sending THE GUN across the room as THE BULLET takes out a CHUNK OF WALL PLASTER right next to Carter's head. "
      } ],
      "key_words" : [ "FIRES", "CARTER", "THE BULLET", "THE GUN", "CHUNK OF WALL", "PLASTER" ]
    } ]
  }, {
    "id" : 132,
    "transition" : "",
    "position" : "INT.",
    "place" : "RESTAURANT",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The SOUND OF THE GUNSHOT stops everyone from eating. And all heads look up. MORE OF SANG'S MEN start for the stairs. ",
      "sentences" : [ ],
      "key_words" : [ "SOUND OF THE GUNSHOT", "MORE OF SANG'S MEN" ]
    } ]
  }, {
    "id" : 133,
    "transition" : "",
    "position" : "INT.",
    "place" : "SECOND FLOOR",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The office door crashes open and another man slams to the floor. Lee and Carter run out, right over the top of him. As GUN FIRE ERUPTS behind them, CHEWING UP THE WALL. Carter and Lee race down the stairs. Slamming into more WAITERS. SCREAMS from the dining room. PATRONS head for the door. ",
      "sentences" : [ ],
      "key_words" : [ "CHEWING UP THE WALL", "WAITERS", "GUN FIRE ERUPTS", "PATRONS", "SCREAMS" ]
    } ]
  }, {
    "id" : 134,
    "transition" : "",
    "position" : "INT.",
    "place" : "KITCHEN",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee and Carter burst in. Swinging doors hitting another waiter. His tray goes flying. He slams back into a chef who loses control of a pan of frying shrimp. The kitchen panics. Chefs and waiters try to get out of the way. Carter and Lee head for the back door. And then it really hits Lee. He staggers. Stops. Carter turns. Come on, let's go! Lee weaves as he tries not to fall.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "What're you doin'?!",
        "followup" : "The door slams opens behind them. Nailing the poor chef again. Lee spins around, falls back into Carter's arms."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No, no, don't do this! This is not the time!",
        "followup" : "Carter pushes him up as the men charge into the kitchen. Lee takes a swing, but his hand accidentally hooks a pot of boiling Won Ton soup off the stove, flinging it back at the men as the charge in. They duck the shower of scalding broth. Then Carter starts grabbing every pot off the stove and flinging the hot food at the men. Lee joins in, throwing a barrage of hot chicken, fish, ribs, bok choi, chow mein, and fried rice at the men. Lee staggers to keep from falling. Then Lee grabs two WHOLE CATFISH on a cutting board as Carter starts throwing boxes of fortune cookies at the men. Lee attacks with the two fish. Hits one in the head, blocks a punch with another. The fish thud and SMACK with each blow. Lee swings the FISH together, slapping one man on both sides of his head. Two Catfish have never been more deadly. Another man comes up from behind, but Lee swings the Catfish under his legs and CATCHES THE MAN BEHIND HIM in the groin -CATFISH MOUTH WIDE OPEN. Then Lee spins around and slams his hands against the Catfish's mouth. The jaws clamp tight. The man SCREAMS and buckles. A fifth man dives at Lee, but he staggers, grabbing the man and shoving him headfirst into a ROW OF HANGING POTS. HEAD SMACKING into each one. A sixth man hits Carter from behind. Carter spins around, punches the man, knocking him into the hot stove, his hands going down ONTO THE HOT GRIDDLE. The man screams and turns quickly at Carter who nails him with a huge soup ladle. Lee turns, slipping, but kicking behind, catching another man and sending him crashing into a sink - pile of DIRTY DISHES CASCADING DOWN "
      } ],
      "key_words" : [ "CATFISH MOUTH WIDE", "CARTER", "WHOLE CATFISH", "DIRTY DISHES CASCADING DOWN", "CATCHES THE MAN BEHIND HIM", "ROW OF HANGING POTS", "OPEN", "HEAD SMACKING", "FISH", "SCREAMS", "ONTO THE HOT", "SMACK", "GRIDDLE" ]
    }, {
      "id" : 1,
      "on" : "ON TOP OF HIM",
      "desc" : ". Lee swings wildly. Another man ducks, comes back up, pulling a gun, but Lee is still spinning uncontrollably and hits the man the second time around. The gun flies out of his hand and clanks onto the stove - open flame heating the metal. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 135,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "FANG SHAN RESTAURANT CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "a panic. And among them - Sang. He blends into the crowd and moves down the street. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 136,
    "transition" : "",
    "position" : "INT.",
    "place" : "AMBASSADOR'S JAGUAR",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Han, Russ, Whitney are watching.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "Something's not right.",
        "followup" : "Russ checks his watch. "
      } ],
      "key_words" : [ "WHITNEY" ]
    } ]
  }, {
    "id" : 137,
    "transition" : "CUT BACK TO:",
    "position" : "INT.",
    "place" : "KITCHEN",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee slips, grabbing hold of a refrigerator door to keep from falling. Pulling it open. Door slamming into the head of number seven, face first. Then Lee grabs a tray full of knives, slips backward, accidentally flinging them over his head, back at them. Everyone hits the floor as the KNIVES impale the wall. But one man manages to throw a bottle at Carter. Carter ducks and the bottle crashes into the stove. FLAMES ERUPT as the OIL falls onto the gas flames. The oil soaked wall BURSTS INTO FLAME. And the OVERHEATED BULLETS in the gun on the stove start to EXPLODE. Carter kicks open the back door as THE KITCHEN starts to FILL WITH BLACK OILY SMOKE. ",
      "sentences" : [ ],
      "key_words" : [ "EXPLODE", "FILL WITH", "OIL", "KNIVES", "OVERHEATED BULLETS", "BURSTS INTO FLAME", "BLACK OILY SMOKE", "FLAMES ERUPT", "THE KITCHEN" ]
    } ]
  }, {
    "id" : 138,
    "transition" : "",
    "position" : "EXT.",
    "place" : "KITCHEN",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter and Lee jump into the alley as the KITCHEN IGNITES. GAS MAIN BLOWING. WINDOWS SHATTER. FLAMES BLOW INTO THE ALLEY. Lee and Carter are knocked down. And they get up slowly. Both are covered in kitchen crap. Food, oil, dirt. Now, they move quickly down the alley. Then Carter sees his GUN on the ground. He picks it up.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh man, I don't even wanna know how it got out here!",
        "followup" : "Lee staggers. Carter grabs him. A POLICE CAR roars up in front of them. POLICE are out, guns drawn, pointing at Carter and Lee."
      }, {
        "shot_id" : 0,
        "character" : "POLICE OFFICER",
        "line" : "Drop the gun!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'm L.A.P.D.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SECOND POLICE OFFICER",
        "line" : "CARTER (reaching for his pocket) I've got my i.d.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "POLICE OFFICER",
        "line" : "No!",
        "followup" : "The police crouch, GUNS POINTED AT CARTER. Carter freezes, hand in pocket. Then Carter realizes he doesn't have it."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No, wait. I don't have it. (to Lee) You have it.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Oh yes.",
        "followup" : "Lee, staggering, reaches for his pocket. The Police IMMEDIATELY TURN their guns on Lee."
      }, {
        "shot_id" : 0,
        "character" : "SECOND POLICE OFFICER",
        "line" : "Nobody move! But Lee suddenly realizes --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Oh no, I dropped it.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You drop my gun and you lose my i.d.?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I'm sorry.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "POLICE OFFICER",
        "line" : "You lent him your i.d.?",
        "followup" : "Lee is completely leaning against Carter to keep from falling over. Carter hangs on, leaning back against him."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(angry) Yeah, I lent him my i.d. You got a problem with that?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SECOND POLICE OFFICER",
        "line" : "No, I can see the resemblance. GET YOUR HANDS ON TOP OF YOUR HEADS! ",
        "followup" : ""
      } ],
      "key_words" : [ "YOUR HANDS ON TOP OF YOUR HEADS", "CARTER", "IMMEDIATELY TURN", "GUNS POINTED AT CARTER", "BLOWING", "POLICE", "GUN", "POLICE OFFICER", "FLAMES BLOW INTO THE ALLEY", "LEE", "POLICE CAR", "KITCHEN IGNITES", "GAS MAIN", "GET", "WINDOWS SHATTER", "I'", "SECOND POLICE OFFICER" ]
    } ]
  }, {
    "id" : 139,
    "transition" : "DISSOLVE TO:",
    "position" : "EXT.",
    "place" : "CHINESE CONSULATE",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "THREE FEDERAL UNMARKED CARS screech to a stop in front. Doors open. Lee and Carter are escorted by a BEVY OF FBI AGENTS. Both Lee and Carter are still covered with the mess from the kitchen fight. Carter still partially carries Lee.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(to Lee) Don't worry. We're gonna make a full report. Bring these boys up to date.",
        "followup" : "Carter looks confidently at the bureau boys surrounding him. They all look straight ahead, no expression, no comment. "
      } ],
      "key_words" : [ "CARTER", "THREE FEDERAL UNMARKED CARS", "BEVY OF FBI AGENTS" ]
    } ]
  }, {
    "id" : 140,
    "transition" : "",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE",
    "time" : "HAN'S OFFICE CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter is split off from Lee by the AGENTS. Carter is lead into the office. Lee is escorted up the stairs.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hey, wait a minute, he's with me.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "AGENT",
        "line" : "Shut up.",
        "followup" : "They push Carter into the office. Pulling the door shut. Lee is lead across the room. "
      } ],
      "key_words" : [ "AGENT", "CARTER", "AGENTS" ]
    } ]
  }, {
    "id" : 141,
    "transition" : "",
    "position" : "INT.",
    "place" : "HAN'S OFFICE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ is seated behind the desk, on the phone.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "... yes, he's here. Uh-huh... Absolutely. Russ hangs up, stands to face Carter.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Okay, let me start from the top. A few days ago I was on this munitions dealer named Lafontaine. Now, after the shit blew up last night...",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(interrupting) I'm not interested, Carter. You're no longer on this assignment. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "What?!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "And your buddy, Mr. Lee, is on his way back to China. Now, get out. Before I file obstruction of justice charges against you.",
        "followup" : "Carter is stunned. TWO AGENTS open the door behind him. Carter hesitates. He's angry. But this is not the time or the place. He exits. "
      } ],
      "key_words" : [ "TWO AGENTS", "CARTER", "RUSS", "I'" ]
    } ]
  }, {
    "id" : 142,
    "transition" : "",
    "position" : "INT.",
    "place" : "ANOTHER ROOM",
    "time" : "CHINESE CONSULATE DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Han is pacing. Lee is leaning against a wall to keep from falling over. Ashamed. Conversation in MANDARIN.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "I have disappointed you.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "My disappointment is not what matters.",
        "followup" : "Lee tries to take a step toward Han, but his knees start to get weak and he leans back against the wall. Han turns away from Lee. He can't stand to look at him in his condition."
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I have no say in it now. I must rely upon the FBI to get Soon-Young back. They will escort you to the airport.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "It was Juntao. Han turns.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Juntao?",
        "followup" : "Lee nods. The door suddenly opens and Carter enters with TWO AGENTS trying to keep him from doing so. Carter pulls away from them."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Mr. Ambassador, I just want you to know that whatever you think Lee did, he didn't. It was my fault.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "AGENT",
        "line" : "(to Han) Sorry, sir.",
        "followup" : "Carter straightens out his dirty coat. Trying to find some dignity in his filthy appearance."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I never intended to risk your daughter's life... The PHONE RINGS. Russ and three agents enter quickly.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "We've got a call. (to agents) Get them out!",
        "followup" : "The Agents move to Lee and Carter. Escorting them out of the room. The door closes."
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "Okay, pick it up.",
        "followup" : "Han picks up a phone at the same time Russ picks up a second phone. "
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "(into phone) Yes.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG'S VOICE",
        "line" : "You have run out of time. The amount now is two hundred million. I will call later with instructions. You will either deliver the money or pick up the body of your daughter.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Please, you must understand, what happened today was not --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SOON YOUNG'S VOICE",
        "line" : "Dad, are you okay?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "(stunned) Soon Young! ",
        "followup" : ""
      } ],
      "key_words" : [ "CARTER", "RUSS", "MANDARIN", "FBI", "LEE", "AGENT", "TWO AGENTS", "SANG'S VOICE", "HAN", "SOON YOUNG'S VOICE", "PHONE RINGS" ]
    } ]
  }, {
    "id" : 143,
    "transition" : "",
    "position" : "INT.",
    "place" : "VAN",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Sang is holding the phone to Soon Young. The black mask has been pulled up so she can talk.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "SOON YOUNG",
        "line" : "Please, do what they ask or they will kill me. BACK TO HAN",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Soon Young, tell them I will do --",
        "followup" : "The phone goes dead. End of conversation. Han looks at Russ, then turns away, trying to maintain his composure. "
      } ],
      "key_words" : [ "SOON YOUNG", "HAN", "BACK TO HAN" ]
    } ]
  }, {
    "id" : 144,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "CHINESE CONSULATE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee and Carter are waiting outside the consulate. Agents flanking them. CARS are driving in through the gates.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'm sorry, Lee.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Be sorry for Soon Young. She has no chance now.",
        "followup" : "The first car pulls up. Agents opens the back door. Lee gets in. Car pulls away. Second car pulls up. It's Carter's Cadillac. Agent gets out, leaves the car running. Waits by the door. Nice job. Carter hands a DOLLAR to the Agent as he gets into the car. He tears out of the drive as the Agent crumples the bill and throws it after him. "
      } ],
      "key_words" : [ "CARS", "CARTER", "DOLLAR", "LEE", "I'" ]
    } ]
  }, {
    "id" : 145,
    "transition" : "CUT BACK TO:",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ, Han, Whitney. Han is seated, head in hands. Whitney gets a call over his radio ear phone.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "Excuse me, sir. Mr. Griffin has arrived.",
        "followup" : "Han looks up. Russ nods to Whitney, who crosses to the door, opens it. Han's face brightens when he sees GRIFFIN. Griffin smiles. New hope has arrived."
      }, {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "I'm sorry, my friend. I could not sit back and do nothing.",
        "followup" : "Griffin bows to Han. "
      } ],
      "key_words" : [ "WHITNEY", "GRIFFIN", "I'" ]
    } ]
  }, {
    "id" : 146,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "FREEWAY",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A SEDAN moves past in traffic. ",
      "sentences" : [ ],
      "key_words" : [ "SEDAN" ]
    } ]
  }, {
    "id" : 147,
    "transition" : "",
    "position" : "INT.",
    "place" : "SEDAN",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Evans is behind the wheel. Monroe next to him. Lee is in the back seat. He looks out the window at Los Angeles moving past. A SIGN READS: LAX. Lee is feeling very much alone. ",
      "sentences" : [ ],
      "key_words" : [ "LAX", "SIGN", "READS" ]
    } ]
  }, {
    "id" : 148,
    "transition" : "",
    "position" : "INT.",
    "place" : "CARTER'S CADILLAC",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "He changes lanes as he follows Lee's car off the freeway. He dials his cell phone one handed.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(on the phone) Don't hang up. Please. INTERCUT With Johnson at home. She just got out of the SHOWER.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "You got a lot of guts calling me.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "you, Johnson. There's no one else I can trust.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "You made a fool out of me! In front of the FBI!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Listen, this ain't about us! It's about a thirteen year old girl. She's not gonna make it. Unless we do something. That works on Johnson. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Jesus...what do you want?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "This whole thing is goin' down tonight. I need to know where the Ambassador is gonna be. The Feds will be keepin' a lid on everything. You thing you can do that?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "This is my city. I'm a cop. I'll find em.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Alright, Johnson, thank you. (pause) So...what are you wearing?",
        "followup" : "CLICK. "
      } ],
      "key_words" : [ "CARTER", "INTERCUT", "FBI", "JOHNSON", "SHOWER", "CLICK", "I'" ]
    } ]
  }, {
    "id" : 149,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "LAX INTERNATIONAL TERMINAL",
    "time" : "DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter moves quickly through the terminal. Keeping his distance from Evans and Monroe as they escort Lee toward the gate. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 150,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CHINA AIRLINES GATE",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Evans and Monroe exit the plane. Lee is sitting in First Class. Staring out the window. Completely depressed. Going home in disgrace. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 151,
    "transition" : "",
    "position" : "INT.",
    "place" : "TERMINAL",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Evans and Monroe turn from the window and start walking away from the gate. We stay with what WOULD HAVE BEEN their POV of the 747. After a beat, a FOOD CART rises up to the 747 door. Carter is leaning against the cart, enjoying the ride. ",
      "sentences" : [ ],
      "key_words" : [ "POV", "FOOD CART", "WOULD HAVE BEEN" ]
    } ]
  }, {
    "id" : 152,
    "transition" : "",
    "position" : "INT.",
    "place" : "747",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Everyone seated. Lee sits quietly. Lee looks up. Carter is standing at his seat. We HEAR the plane door close in preparation for taxi.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "What are you doing here?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Well, I ain't goin' to China. (whispering) And neither are you.",
        "followup" : "Carter moves up the aisle to a FLIGHT ATTENDANT. He takes a handkerchief out of his pocket and puts it over his face."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Excuse me. I'm declaring a medical emergency.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FLIGHT ATTENDANT",
        "line" : "What? Are you sick?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No, no, not me. (points at Lee) My patient. Lee HEARS that he's the sick man. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I am Doctor...Dwight Gooden. Center for Disease Control. And I have to get him off this airplane. Now.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FLIGHT ATTENDANT",
        "line" : "What's wrong with him?",
        "followup" : "Lee looks at Carter. He'd like to know what's wrong with him too. Carter WHISPERS VERY LOUDLY so the whole first class compartment can hear."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "He escaped from our clinic. He's got the Eboola...Moola virus. Very deadly. It's transmitted by the breath.",
        "followup" : "A collective GASP goes up from the first class passengers."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Especially bad breath.",
        "followup" : "Lee immediately starts MOANING. Carter suddenly goes into FAKE CHINESE, directed at Lee. Lee looks at him for a beat and then ANSWERS IN REAL MANDARIN. Oh God, we're in trouble. He's already started the chills... Lee starts SHAKING like he has a fever."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "And diarrhea. Lee looks at him like, how am I supposed to do that?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "I mean gas?",
        "followup" : "Lee looks over at a middle aged woman, and COUGHS at her. The woman SCREAMS."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "Open the door!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FLIGHT ATTENDANT",
        "line" : "I can't open the door! We're ready to taxi.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Open the door now!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "FLIGHT ATTENDANT",
        "line" : "But I --",
        "followup" : "Lee turns to a BANK PRESIDENT sitting next to him. He coughs at him. The guy SCREAMS and covers his face with his WALL STREET JOURNAL. Carter pulls Lee out of the seat."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Open the door, open the door! Carter goes into another burst of FAKE CHINESE. Lee HOWLS and MOANS.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Hurry! The projectile vomiting is about to begin!",
        "followup" : "The Flight Attendant rushes to the door, opens it. And Lee runs for it, continuing to HOWL with Carter clinging to him. "
      } ],
      "key_words" : [ "CARTER", "FAKE CHINESE", "MOANS", "WHISPERS VERY LOUDLY", "HEAR", "MOANING", "GASP", "SCREAMS", "SHAKING", "COUGHS", "BANK PRESIDENT", "HOWLS", "LEE", "WALL STREET JOURNAL", "HEARS", "ANSWERS IN REAL MANDARIN", "HOWL", "I'", "FLIGHT ATTENDANT" ]
    } ]
  }, {
    "id" : 153,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE",
    "time" : "HAN'S OFFICE DAY",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ, Han, Whitney and other Agents. Griffin has the floor.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "For fifteen years, Juntao has been the most powerful crime lord in southeast Asia, until the Chinese government regained control of Hong Kong. The his operation, but failed.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "But why the Ambassador's daughter?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "One of the last efforts between the British and the Chinese Governments was to raid every known asset of Juntao's operation. We confiscated over five hundred million dollars in weapons, drugs and a collection of Chinese art unsurpassed in the world.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "But Juntao disappeared once again. Without witnesses.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "WHITNEY",
        "line" : "Will he kill the girl?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "I don't know. According to our informant, Juntao is seeking restitution. My advise is... pay the money. ",
        "followup" : ""
      } ],
      "key_words" : [ "WHITNEY", "HAN", "RUSS", "GRIFFIN" ]
    } ]
  }, {
    "id" : 154,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "CHINESE CONSULATE",
    "time" : "HAN'S OFFICE NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The phone rings. Machines go into action. All FBI Agents in the room are looking tired, worn out by the ordeal. Han, now dressed in a tux, enters quickly, moving to the phone. Answers.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "Hello.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "SANG'S VOICE",
        "line" : "Take the money with you tonight. Pack it in six dragons. You will be contacted again.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I want to speak with my daughter! ",
        "followup" : "The phone clicks dead. "
      } ],
      "key_words" : [ "SANG'S VOICE", "HAN", "FBI" ]
    } ]
  }, {
    "id" : 155,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "JOHNSON'S APARTMENT-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The door opens revealing Johnson dressed in an elegant sequined evening gown. She looks gorgeous.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Oh my god...what happened to you?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "CARTER It's called you're gonna kill me. What're you doin' with that on?",
        "followup" : "Johnson crosses the room. Picks up TWO TUXEDOS hanging on a door."
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "The Ambassador is hosting the closing night of Chinese Expo at the Convention Center. It's black tie. Carter is trying not to look at Johnson's cleavage.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Well...OK. Good job. Johnson hands one tux to Carter, the other to Lee.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "(to Lee) I'm Johnson. I had to guess at your size.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Thank you. You look very beautiful. Johnson smiles.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(to Lee) Hey, stop that. We're workin' here! I can't believe you be talkin' that shit. That's totally unprofessional!",
        "followup" : "Carter grabs his tux and storms into the bathroom. "
      } ],
      "key_words" : [ "JOHNSON", "CARTER", "TWO TUXEDOS", "OK", "LEE", "I'" ]
    } ]
  }, {
    "id" : 156,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "HELICOPTER-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "It lifts off from Van Nuys and swoops over our heads. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 157,
    "transition" : "",
    "position" : "",
    "place" : "INT.HELICOPTER-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The PILOT is Asian. TWO MEN are in the back. We recognize them from the fight at the restaurant. They each carry automatic weapons. ",
      "sentences" : [ ],
      "key_words" : [ "PILOT", "TWO MEN" ]
    } ]
  }, {
    "id" : 158,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "JOHNSON'S APARTMENT-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee and Carter walk up to the Cadillac dressed in their tuxedos. Johnson stops dead when she sees the car.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Wait a minute. I'm not riding in that.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "What?! This is a class ride, Johnson.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "Yeah, if you're Superfly.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "That's it! You can attack me, but when you attack my car, I cannot forgive! You in the back, girl!",
        "followup" : "Lee gallantly opens the door for Johnson who reluctantly gets in the back seat. Lee starts to get back there with her."
      }, {
        "shot_id" : 0,
        "character" : "CARTER (cont'd)",
        "line" : "(to Lee) Where the hell are you goin'?!",
        "followup" : "Lee gets up front. "
      } ],
      "key_words" : [ "JOHNSON", "CARTER", "I'" ]
    } ]
  }, {
    "id" : 159,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "CONVENTION CENTER",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "CHINESE FLAGS flutter over the event. Lots of sparkle. MEN in tuxedos and WOMEN in gowns are arriving. Over the entrance we see a huge banner - CHINESE EXPO. ",
      "sentences" : [ ],
      "key_words" : [ "WOMEN", "CHINESE EXPO", "CHINESE FLAGS", "MEN" ]
    } ]
  }, {
    "id" : 160,
    "transition" : "",
    "position" : "",
    "place" : "INT.SOUTH HALL (CONVENTION CENTER)",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Escalators move down to a huge room filled with art of all kinds, including huge sculptures, Chinese screens, glass and ceramic vases in large DISPLAY CASES. In fact, we may recognize some of the art from the opening bust in Hong Kong. Dominating the center of the room is a LARGE BUDDHA standing on the edge of a HUGE POOL filled with water. A REFRESHMENT STAND is doing brisk business. We see Ambassador Han and his wife circulating, shaking hands, talking. Trying their best not to show their tension and fear. Griffin is with them. Glass of wine in hand. Shaking hands and chatting. Whitney moves through the crowd of people. Keeping watch on Han. He glances across the room at Monroe. Monroe is also alert. But they are both in tuxes. And unless you knew they were FBI, you couldn't tell. ",
      "sentences" : [ ],
      "key_words" : [ "DISPLAY CASES", "LARGE BUDDHA", "HUGE POOL", "REFRESHMENT STAND", "FBI" ]
    } ]
  }, {
    "id" : 161,
    "transition" : "",
    "position" : "INT.",
    "place" : "FBI SURVEILLANCE VAN",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "AGENTS monitor the event with video monitors and listening devices.",
      "sentences" : [ ],
      "key_words" : [ "AGENTS" ]
    }, {
      "id" : 1,
      "on" : "ON ONE OF THE MONITORS",
      "desc" : "We see the Cadillac pull up with Carter, Johnson and Lee.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "AGENT",
        "line" : "California License. Three people inside. African American male. Asian male. ",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "AGENT",
        "line" : "Running plate. ",
        "followup" : ""
      } ],
      "key_words" : [ "AGENT" ]
    } ]
  }, {
    "id" : 162,
    "transition" : "",
    "position" : "INT.",
    "place" : "UNDERCOVER CAR",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Evans and Monroe, parked back from the entrance. Connected to the van by radio. Monroe perks up at the description.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "MONROE",
        "line" : "African American male with Asian male? Monroe looks at Evans.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "EVANS",
        "line" : "It can't be. Monroe picks up his binoculars --",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "MONROE",
        "line" : "Oh shit. ",
        "followup" : ""
      } ],
      "key_words" : [ "EVANS", "MONROE" ]
    } ]
  }, {
    "id" : 163,
    "transition" : "",
    "position" : "EXT.",
    "place" : "CONVENTION CENTER-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter, Lee and Johnson move over a red carpet and enter the Convention Center. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 164,
    "transition" : "",
    "position" : "INT.",
    "place" : "A ROOM ON THE SECOND FLOOR",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "SIX CERAMIC DRAGONS are being loaded with 200 million dollars in U.S. CASH. Russ watches as he gets the call.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "EVANS VOICE",
        "line" : "Sir, we just identified Carter and Lee.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "What?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "EVANS VOICE",
        "line" : "They've just arrived. With a woman. We don't have an i.d. on her.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "I want them picked up. NOW!",
        "followup" : ""
      } ],
      "key_words" : [ "RUSS", "NOW", "SIX CERAMIC DRAGONS", "EVANS VOICE", "CASH" ]
    }, {
      "id" : 1,
      "on" : "ON THE HELICOPTER",
      "desc" : "It banks over a freeway, heading for downtown. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 165,
    "transition" : "",
    "position" : "INT.",
    "place" : "SOUTH HALL",
    "time" : "CONTINUOUS",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Griffin looks at his watch. Glances across the room at ONE OF THE SECURITY GUARDS standing in the b.g. We see it's Sang. Griffin glances at TWO MORE SECURITY GUARDS. Shu and Chung.",
      "sentences" : [ ],
      "key_words" : [ "SECURITY GUARDS", "ONE OF THE", "TWO MORE SECURITY GUARDS" ]
    }, {
      "id" : 1,
      "on" : "ON HAN",
      "desc" : "A SOCIALITE crosses to him.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "SOCIALITE",
        "line" : "The exhibit is extraordinary, Mr. Ambassador. I hope this is just the beginning of more cultural exchanges between our two countries.",
        "followup" : "Han forces a smile. "
      } ],
      "key_words" : [ "SOCIALITE" ]
    } ]
  }, {
    "id" : 166,
    "transition" : "",
    "position" : "INT.",
    "place" : "SOUTH LOBBY",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter, Lee and Johnson come down the escalator into the hall.",
      "sentences" : [ ],
      "key_words" : [ ]
    }, {
      "id" : 1,
      "on" : "ON WHITNEY",
      "desc" : "He gets some disturbing news over his ear phone.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "WHITNEY",
        "line" : "(into radio) How the hell did they get here?",
        "followup" : "Whitney turns quickly, scanning the crowd. But the place is packed. Black ties and gowns everywhere."
      } ],
      "key_words" : [ "WHITNEY" ]
    }, {
      "id" : 2,
      "on" : "ON CARTER",
      "desc" : ", JOHNSON, LEE They're walking past the exhibits.",
      "sentences" : [ {
        "shot_id" : 2,
        "character" : "LEE",
        "line" : "Oh no.",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "What?",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "LEE",
        "line" : "The art.",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "JOHNSON",
        "line" : "(to Lee) You don't like it?",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "It's okay. For restaurants. ",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "LEE",
        "line" : "No, it is China, my country, my history. If any of it gets damaged...",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "Hey, don't worry. Nothing's gonna happen to it. Carter turns and sees Griffin through the crowd.",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "Wait. That guy. I saw him outside the restaurant.",
        "followup" : "Carter points through the crowd at Griffin. Lee is shocked."
      }, {
        "shot_id" : 2,
        "character" : "LEE",
        "line" : "Oh my god. Griffin.",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "You know him?",
        "followup" : "But Lee is already moving toward Griffin."
      } ],
      "key_words" : [ "CARTER", "LEE", "JOHNSON" ]
    }, {
      "id" : 3,
      "on" : "ON GRIFFIN",
      "desc" : "He's talking with someone when he happens to catch Lee moving towards him. He never loses his smile. Until he sees Lee mouth the word:",
      "sentences" : [ {
        "shot_id" : 3,
        "character" : "LEE",
        "line" : "Juntao.",
        "followup" : "Griffin looks around and sees Carter moving in from another direction. Griffin quickly excuses himself and heads for the escalator."
      } ],
      "key_words" : [ "LEE" ]
    }, {
      "id" : 4,
      "on" : "ON WHITNEY",
      "desc" : "He spots Carter and Johnson moving towards the escalator as they follow Griffin.",
      "sentences" : [ {
        "shot_id" : 4,
        "character" : "WHITNEY",
        "line" : "(into RADIO) Wait. I see Carter. Request assistance immediately.",
        "followup" : "Suddenly, Johnson appears at Whitney's side. She flashes her LAPD badge and says:"
      }, {
        "shot_id" : 4,
        "character" : "JOHNSON",
        "line" : "I got to talk to you. Now.",
        "followup" : ""
      } ],
      "key_words" : [ "JOHNSON", "WHITNEY", "RADIO", "LAPD" ]
    }, {
      "id" : 5,
      "on" : "ON GRIFFIN",
      "desc" : "He moves to a PODIUM WITH A MICROPHONE that overlooks the room below.",
      "sentences" : [ {
        "shot_id" : 5,
        "character" : "GRIFFIN",
        "line" : "Ladies and Gentlemen, can I have your attention please? The crowd hushes.",
        "followup" : ""
      }, {
        "shot_id" : 5,
        "character" : "GRIFFIN (cont'd)",
        "line" : "Welcome to Chinese Expo. The exhibit you see before you represents over a thousand years of Chinese art. Up until several months ago, most of this exhibit was in the hands of one private collector. (pause) Me. So, I should say more correctly, welcome to my exhibit. ",
        "followup" : ""
      } ],
      "key_words" : [ "MICROPHONE", "PODIUM WITH", "GRIFFIN" ]
    }, {
      "id" : 6,
      "on" : "ON HAN",
      "desc" : "He looks up with a puzzled expression at his friend.",
      "sentences" : [ ],
      "key_words" : [ ]
    }, {
      "id" : 7,
      "on" : "ON WHITNEY",
      "desc" : "He looks up at Griffin too as Johnson keeps filling him in.",
      "sentences" : [ {
        "shot_id" : 7,
        "character" : "GRIFFIN (cont'd)",
        "line" : "Great collectors are born, not made. It took most of my life to find and catalog the priceless pieces you see. And then, in one fell swoop, they were taken from me. But tonight, I will be paid in full. Griffin holds up a DETONATOR.",
        "followup" : ""
      }, {
        "shot_id" : 7,
        "character" : "GRIFFIN (cont'd)",
        "line" : "A bomb is wired to Ambassador Han's daughter in a car outside.",
        "followup" : "AUDIBLE GASPS from the floor. Carter immediately ducks down in the crowd and runs bent over for the exit."
      } ],
      "key_words" : [ "AUDIBLE GASPS", "DETONATOR", "GRIFFIN" ]
    }, {
      "id" : 8,
      "on" : "ON WHITNEY",
      "desc" : "He turns to his lapel mike. It's immediately ripped off his collar by Sang. Other agents on the floor are quickly stopped from communicating by Griffin's men.",
      "sentences" : [ {
        "shot_id" : 8,
        "character" : "GRIFFIN (cont'd)",
        "line" : "No one moves! Lee stares up at Griffin trying to figure out what to do.",
        "followup" : ""
      }, {
        "shot_id" : 8,
        "character" : "GRIFFIN (cont'd)",
        "line" : "She will die if I push this button. But if you are all patient, my transportation will be here shortly and you can continue to enjoy my collection. Everyone just stay calm. (to Han) You just picked on the wrong guy, my friend. ",
        "followup" : ""
      } ],
      "key_words" : [ "GRIFFIN" ]
    } ]
  }, {
    "id" : 167,
    "transition" : "",
    "position" : "",
    "place" : "INT.THE SECOND FLOOR ROOM",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Russ, unaware of the situation on the exhibit floor, continues to monitor the loading of the dragons. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 168,
    "transition" : "CUT TO:",
    "position" : "EXT.",
    "place" : "STREET",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Shu is leaning against the van in the parking lot.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "MAN'S VOICE",
        "line" : "You're parked in a red zone. facing Carter who has his gun out, pointed at him.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "It's not red now, but you try anything, and it's gonna be blood red. Carter moves up to him, keeping the gun leveled.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Only one problem. I forgot my cuffs.",
        "followup" : "He grabs Shu's head and slams it into the side of the van. Shu drops. Out cold. Carter pulls keys from Shu's pocket."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "You have the right to remain silent alllll night.",
        "followup" : "Carter moves to the back of the van. Looks at the LICENSE. CALIFORNIA. LIK. Unlocks the back door. Stands back, ready to shoot, as he opens the door. Looks in."
      } ],
      "key_words" : [ "MAN'S VOICE", "CARTER", "CALIFORNIA", "LICENSE", "LIK" ]
    }, {
      "id" : 1,
      "on" : "ON SOON YOUNG",
      "desc" : "She's in the back of the van. Black hood over her face. She's wearing a BULKY VEST that is covered with plastic explosive. Carter pulls the hood off.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "Hi. Detective Carter, LAPD. Let's get this thing off you.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "SOON YOUNG",
        "line" : "(near tears) NO! Don't touch it! I heard them say it will explode. Carter hesitates. ",
        "followup" : ""
      } ],
      "key_words" : [ "NO", "CARTER", "SOON YOUNG", "BULKY VEST", "LAPD" ]
    } ]
  }, {
    "id" : 169,
    "transition" : "CUT TO:",
    "position" : "",
    "place" : "INT.CONVENTION CENTER",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Griffin stands at the podium, still holding the detonator high so everyone can see it. He speaks quietly into his lapel mike.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Where are you? ",
        "followup" : ""
      } ],
      "key_words" : [ "GRIFFIN" ]
    } ]
  }, {
    "id" : 170,
    "transition" : "",
    "position" : "",
    "place" : "INT. HELICOPTER-NIGHT",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The pilot keys his mike. Three minutes. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 171,
    "transition" : "",
    "position" : "",
    "place" : "INT.CONVENTION CENTER",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Griffin nods to Sang down on the floor. Sang starts moving up the escalator.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "Thank you, ladies and gentlemen. We'll be calling this an evening.",
        "followup" : "Suddenly we HEAR a CLATTER AND RUMBLE. Low at first, but building LOUDER and LOUDER. Everyone turns. THROUGH THE PLATE GLASS WINDOW we can SEE THE VAN tearing up the museum steps. Right toward the window. And it's not stopping."
      } ],
      "key_words" : [ "THROUGH THE PLATE GLASS WINDOW", "SEE THE VAN", "CLATTER AND RUMBLE", "GRIFFIN", "LOUDER", "HEAR" ]
    }, {
      "id" : 1,
      "on" : "ON THE VAN",
      "desc" : "It crashes RIGHT INTO THE WINDOW. Everyone scatters. The Van roars into the hall. It knocks over a huge DISPLAY CASE scattering glass everywhere. Finally, it RAMS the refreshment booth and stops in the middle of the room. The BACK DOORS OPEN and Carter steps out with Soon Young who is still wearing the bomb.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "(to Griffin) Okay, asshole, here's your bomb. You wanna blow somebody up, go ahead. Push the button. Let's blow everybody up.",
        "followup" : "Everyone who didn't panic before, does now. People start running."
      }, {
        "shot_id" : 1,
        "character" : "HAN",
        "line" : "Soon Young!",
        "followup" : "An FBI AGENT grabs Han and his wife and pushes them down on the floor. Lee and Johnson run to Soon Young's side."
      } ],
      "key_words" : [ "CARTER", "RAMS", "HAN", "DISPLAY CASE", "FBI AGENT", "BACK DOORS OPEN", "RIGHT INTO THE WINDOW" ]
    }, {
      "id" : 2,
      "on" : "ON GRIFFIN",
      "desc" : "For the first time, he looks scared. He turns away from the podium and runs. Sang turns on the escalator, pulls a MAC 10 and sprays the room. FBI agents on the floor take cover behind the priceless art work, pull guns and start firing. Griffin's men return fire as the last of the black tie crowd hit the deck. Johnson grabs Soon Young and ducks back in the van with Lee. ",
      "sentences" : [ ],
      "key_words" : [ "FBI", "MAC" ]
    } ]
  }, {
    "id" : 172,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "THE SECOND FLOOR ROOM",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The last of the money is being loaded from one remaining suitcase and put into the dragons by two agents. Russ watches. Suddenly, Griffin runs into the room and opens fire with a nine millimeter. He hits the two agents doing the packing. Russ, totally taken by surprise, reaches for his weapon, but Russ cuts him down. Griffin grabs the last full suitcase and runs out. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 173,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "THE VAN",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Johnson is studying the bomb. Soon Young continues to whimper.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "(to Soon Young) It's gonna be OK.",
        "followup" : "The battle RAGES outside. Occasionally, the van is hit by gun fire."
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Can you get it off?",
        "followup" : "Johnson doesn't answer. Instead, she pulls a SWISS ARMY KNIFE out of her dainty purse, flips out the tiny scissors and cuts TWO WIRES leading to one of the CLASPS on the vest."
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON",
        "line" : "OK. Lee helps her take the vest off. Johnson hands it to Lee.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON (cont'd)",
        "line" : "Get rid of it. The detonator can still set it off. And this... She points to a SWITCH on the front of the vest. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "JOHNSON (cont'd)",
        "line" : "Don't touch. It's a back up. Short fuse. Five...maybe ten seconds.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "I'll cover you.",
        "followup" : "At that moment, the van is hit hard with automatic fire. Johnson throws herself over Soon Young as Carter and Lee dive out the back door. "
      } ],
      "key_words" : [ "CARTER", "RAGES", "SWISS ARMY KNIFE", "JOHNSON", "TWO WIRES", "SWITCH", "OK", "CLASPS", "I'" ]
    } ]
  }, {
    "id" : 174,
    "transition" : "",
    "position" : "",
    "place" : "INT.THE HALL",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Carter and Lee jump behind the Buddha. Gunfire erupts from all quarters.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "(to Lee) Go!",
        "followup" : "Lee takes off for the escalator. He runs half way up when Russ appears at the top. He's bleeding badly and staggering."
      }, {
        "shot_id" : 0,
        "character" : "RUSS",
        "line" : "(to Lee) Griffin...the elevator.",
        "followup" : "Russ collapses. Lee looks up. A hundred and fifty feet above him, we see a catwalk below the skylights that make up the roof. The catwalk leads to AN OPEN ROOF DOOR. Lee scans the ceiling and spots an ENCLOSED LADDER that leads all the way up to the catwalk. He takes off. "
      } ],
      "key_words" : [ "CARTER", "ENCLOSED LADDER", "RUSS", "AN OPEN ROOF DOOR" ]
    } ]
  }, {
    "id" : 175,
    "transition" : "CUT TO:",
    "position" : "INT.",
    "place" : "AN ELEVATOR",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Griffin keys his mike.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "GRIFFIN",
        "line" : "(into radio) Plan B. Meet me on the roof. ",
        "followup" : ""
      } ],
      "key_words" : [ "GRIFFIN" ]
    } ]
  }, {
    "id" : 176,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE HELICOPTER",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The pilot is just getting ready to set the chopper down in the parking lot. He aborts and pulls full power. The chopper starts to rise. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 177,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE HALL",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee reaches the ladder, PUTS THE BOMB JACKET ON and starts climbing.",
      "sentences" : [ ],
      "key_words" : [ "PUTS THE BOMB JACKET ON" ]
    }, {
      "id" : 1,
      "on" : "ON CARTER",
      "desc" : "He runs up the escalator and bends down to Russ. He's alive but hurt bad. Carter turns and sees SANG running and firing BELOW HIM. Carter leaps off the escalator and lands on Sang. ",
      "sentences" : [ ],
      "key_words" : [ "SANG", "BELOW HIM" ]
    } ]
  }, {
    "id" : 178,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE ELEVATOR",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Griffin looks down at the detonator in his hand. For a second he looks like he's going to push the button. But he hesitates. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 179,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE LADDER",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee is flying up it at superhuman speed. When the inside ladder proves too slow, he switches to the outside GUARD CAGE and climbs that.",
      "sentences" : [ ],
      "key_words" : [ "GUARD CAGE" ]
    }, {
      "id" : 1,
      "on" : "ON SANG AND CARTER",
      "desc" : "Sang is kicking the shit out of Carter. Carter gets in one punch and Sang hits him three times and sweeps his feet out from under him. ",
      "sentences" : [ ],
      "key_words" : [ ]
    } ]
  }, {
    "id" : 180,
    "transition" : "",
    "position" : "EXT.",
    "place" : "THE ELEVATOR",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The doors open and Griffin walks out onto the catwalk that runs just below the ceiling. He looks down. GRIFFIN'S POV Below him, the battle still rages, but FBI agents are getting the upper hand. Griffin holds up the detonator. His thumb covers the button.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "LEE'S VOICE",
        "line" : "Looking for this?",
        "followup" : "Griffin looks up and sees Lee, breathing hard, on the other side of the catwalk. He's pointing to the bomb that he's wearing. Griffin fires two shots at Lee that ricochet off the catwalk railing. Lee hits the floor of the catwalk. "
      } ],
      "key_words" : [ "LEE'S VOICE", "GRIFFIN'S POV", "FBI" ]
    } ]
  }, {
    "id" : 181,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE HALL",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Two of Griffin's men are cut down by Whitney as they try to escape up the escalator.",
      "sentences" : [ ],
      "key_words" : [ ]
    }, {
      "id" : 1,
      "on" : "ON SANG AND CARTER",
      "desc" : "Sang KICKS Carter in the face and he goes down. Sang practically stumbles over Carter's gun and picks it up. Carter staggers to his feet. Sang points the gun at Carter and cocks it.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "That's my gun, mother fucker.",
        "followup" : "Carter's hands fly, doing Lee's routine. Suddenly, the gun ends up in Carter's hands. Sang leaps for the gun. Carter drills him in the forehead. "
      } ],
      "key_words" : [ "CARTER", "KICKS" ]
    } ]
  }, {
    "id" : 182,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE CATWALK",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Griffin fires at Lee as he tries to make his way around to the roof door. Lee CRAWLS. Suddenly, a ROAR starts a second before we see the CHOPPER rise into a hover. Griffin runs around the catwalk for the door. Lee looks up and sees a ROPE AND PULLEY hanging over the abyss. He leaps for the railing and dives out into space. He catches the rope and starts riding it to the other side of the catwalk. Griffin sees him coming and fires on the run. He misses. Clicks. The gun is empty. He throws his gun and hits Lee in the HEAD with it. Lee almost falls and then: ",
      "sentences" : [ ],
      "key_words" : [ "HEAD", "ROAR", "CHOPPER", "CRAWLS", "ROPE AND PULLEY" ]
    } ]
  }, {
    "id" : 183,
    "transition" : "",
    "position" : "",
    "place" : "INT.THE HALL",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Things are under the control of the FBI. Carter is holstering his gun when he hears Griffin's shot. And then a second later, the gun smashes into the marble floor. He looks up and sees them fighting on the catwalk. ",
      "sentences" : [ ],
      "key_words" : [ "FBI" ]
    } ]
  }, {
    "id" : 184,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE CATWALK",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Griffin tries to push a groggy Lee off him but he won't let go of his legs. Griffin starts beating Lee over the head with the suitcase. It POPS open and ten million dollars flutters out like confetti. Lee pushes through the money, stands up and grabs Griffin. Griffin tries to get away and HITS THE SWITCH ON THE JACKET. They both stop and look at each other in panic. Then Griffin HEAD BUTTS Lee. Lee starts to go down, but instead, he HEAD BUTTS Griffin back. Griffin crumples. Lee holds him, wriggles out of the vest and PUTS IT ON GRIFFIN. Then he looks down, tips them both over the railing and THEY FALL. WHACK! Lee grabs THE BOTTOM OF THE CATWALK as he goes by. Unfortunately, Griffin woke up and is holding onto Lee's foot. Lee kicks once. Twice. The third is a charm. Griffin falls backwards toward THE BUDDHA POOL. He falls and falls, all the while looking back up at Lee. He hits with a huge splash. CLOSE ON Griffin's face under water. He's still alive. KABOOM! ",
      "sentences" : [ ],
      "key_words" : [ "PUTS IT ON GRIFFIN", "HEAD BUTTS", "WHACK", "POPS", "THEY FALL", "THE BOTTOM OF THE CATWALK", "HITS THE SWITCH ON THE JACKET", "THE BUDDHA POOL", "CLOSE ON", "KABOOM" ]
    } ]
  }, {
    "id" : 185,
    "transition" : "",
    "position" : "INT.",
    "place" : "THE HALL",
    "time" : "",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "A SHOWER OF WATER falls over the hall. Everybody gets wet. ",
      "sentences" : [ ],
      "key_words" : [ "SHOWER OF WATER" ]
    } ]
  }, {
    "id" : 186,
    "transition" : "DISSOLVE TO:",
    "position" : "EXT.",
    "place" : "MUSEUM",
    "time" : "LATER",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "The FBI is escorting the bad guys out of the building. Sang is escorted out by the CORONER. Han approaches Lee. Extends his hand.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "HAN",
        "line" : "I owe you everything.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Only your friendship. Lee looks around at all the BROKEN ART.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE (cont'd)",
        "line" : "It is so sad. So much beauty ruined. So much of our culture gone. Yes. But... (pointing) Life goes on.",
        "followup" : "He's pointing to Soon Young who is in the arms of her mother. Lee smiles."
      } ],
      "key_words" : [ "HAN", "CORONER", "FBI", "BROKEN ART", "LEE" ]
    }, {
      "id" : 1,
      "on" : "ON CARTER",
      "desc" : "He's standing next to Whitney at the top of the escalator. Both Carter and Whitney are SOAKING WET from the water explosion. Whitney is just hanging up a cellular.",
      "sentences" : [ {
        "shot_id" : 1,
        "character" : "WHITNEY",
        "line" : "(to Carter) He'll be OK. Russ is a tough son of a bitch.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "Tell me about it.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "WHITNEY",
        "line" : "He was just doing his job.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "So was I.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LEE VO",
        "line" : "And me too.",
        "followup" : "Lee is standing behind Whitney. Whitney looks a little embarrassed now."
      }, {
        "shot_id" : 1,
        "character" : "WHITNEY",
        "line" : "(mumbling) And the FBI appreciates it. Whitney walks away.",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "CARTER",
        "line" : "Prick.",
        "followup" : "Carter looks at Lee and points up to the ladder that leads to the catwalk."
      }, {
        "shot_id" : 1,
        "character" : "CARTER (cont'd)",
        "line" : "You got circus blood in you?",
        "followup" : ""
      }, {
        "shot_id" : 1,
        "character" : "LEE",
        "line" : "Shortcut.",
        "followup" : "Carter laughs and looks down the escalator."
      } ],
      "key_words" : [ "WHITNEY", "CARTER", "SOAKING WET", "FBI", "LEE", "LEE VO", "OK" ]
    }, {
      "id" : 2,
      "on" : "ON JOHNSON",
      "desc" : "She's sitting on the last step. She's SOAKING WET too. Her hair and dress are ruined. She looks depressed. Carter walks down to her. You OK?",
      "sentences" : [ {
        "shot_id" : 2,
        "character" : "JOHNSON",
        "line" : "We saved the girl and got the bad guys, didn't we?",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "Yeah. So why you look do down?",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "JOHNSON",
        "line" : "Look at me! My dress is ruined. I look like shit.",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "Not to me. Never to me. Johnson stares at him for a long beat.",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "JOHNSON",
        "line" : "How about a lift home?",
        "followup" : ""
      }, {
        "shot_id" : 2,
        "character" : "CARTER",
        "line" : "Absolutely. I'll even let you ride in the front seat. ",
        "followup" : ""
      } ],
      "key_words" : [ "JOHNSON", "CARTER", "SOAKING WET", "OK", "I'" ]
    } ]
  }, {
    "id" : 187,
    "transition" : "DISSOLVE TO:",
    "position" : "INT.",
    "place" : "747",
    "time" : "NIGHT",
    "shots" : [ {
      "id" : 0,
      "on" : "LOCATION",
      "desc" : "Lee is seated, eyes closed, listening to MUSIC over his headphones. Carter walks down the aisle and takes the seat next to him.",
      "sentences" : [ {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "Yo, what's up? Lee opens his eyes. Smiles.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "What a surprise!",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "FBI calls up my ass, says they need help in Tokyo. Like I'm supposed to drop everything.",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "It's Hong Kong, not Tokyo. My country asked for the best. I told them that was you. Now I will show you around my hood. ",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "CARTER",
        "line" : "No shark fin, no camel hump. (re: CD player) What you listenin' to?",
        "followup" : ""
      }, {
        "shot_id" : 0,
        "character" : "LEE",
        "line" : "Oh, I think you like this very much.",
        "followup" : "Carter puts on the head phones. We HEAR the first few bars of HELP ME THE 747 -- CONTINUOUS glides toward Hong Kong to the All-American music of the Beach Boys. "
      } ],
      "key_words" : [ "MUSIC", "CD", "CARTER", "HELP ME", "FBI", "LEE", "CONTINUOUS", "HEAR", "THE", "I'" ]
    } ]
  } ]
}
